documentation/glint/thebook.org
#+title: Programming in Lensor Glint
#+author: lens_r
#+created: 2025-11-04

# Export a table of contents
#+options: toc:t

# Do not treat _ and ^ as subscript and superscript, respectively.
#+options: ^:{}

# Do not export answer drawers.
#+options: d:(not "answer")

#+begin_src emacs-lisp :exports none
  (defun lens/export-the-book ()
    "Export the book when it is your current buffer"
    (interactive)
    (defvar org-html-head "")
    (let
        ((org-html-htmlize-output-type 'css)
         (org-publish-use-timestamps-flag nil)
         (org-html-head
          (concat
           org-html-head
           "<style>"
           ".dark-mode,html{background-color:var(--bg);color:var(--fg)}.dark-mode,html,pre{color:var(--fg)}html{font-family:sans-serif;font-size:max(2.12vh, 8pt);margin:0 auto;transition:none;-moz-transition:none;-o-transition:none;-webkit-transition:none;-ms-text-size-adjust:100%;-webkit-text-size-adjust:100%}:root{--light-fg:#333333;--light-bg:#ffffff;--light-strong-fg:#161718;--dark-fg:#e8e8e8;--dark-bg:#161718;--dark-strong-fg:#f4f4f4;--fg:var(--light-fg);--bg:var(--light-bg);--strong-fg:var(--light-strong-fg)}.dark-mode{--fg:var(--dark-fg);--bg:var(--dark-bg);--strong-fg:var(--dark-strong-fg)}.dark-mode a{color:#3ce}.dark-mode a:visited{color:#9f85ff}.small{font-size:max(1.6vh, 6pt);color:#2a2e33}.dark-mode .small{color:#716f70}pre{background-color:#f8f8f8}.dark-mode pre{background-color:#212223;border-color:#bbb}.dark-mode .org-builtin,.dark-mode .org-keyword{color:#dd64f4}.dark-mode .org-function-name{color:#ffebbb}.dark-mode .org-type{color:#2cabff}.dark-mode .org-string{color:#ffee20}.dark-mode .org-comment,.dark-mode .org-comment-delimiter{color:#7f8388}.dark-mode code span.co,code span.co{color:#308093}.dark-mode code span.fu{color:#2963f5}.org-function-name{color:#c26d3b}.org-builtin,.org-keyword{color:#6f42c1}.org-type,code span.fu{color:#007bff}.org-string{color:#dc3545}.org-comment,.org-comment-delimiter{color:#444343}"
           "</style>"
           )))
      (org-html-export-to-html)
      (copy-file "thebook.html" "../../docs/thebook.html" t))
    (org-latex-export-to-pdf)
    (org-ascii-export-to-ascii))
#+end_src

* Preface

