docs/thebook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-05 Mon 17:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programming in Lensor Glint</title>
<meta name="author" content="lens_r" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Programming in Lensor Glint</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2b7dc99">1. Preface</a>
<ul>
<li><a href="#org3768f01">1.1. Hardware</a></li>
<li><a href="#org288134b">1.2. Software</a></li>
<li><a href="#org2d84d15">1.3. Tooling</a></li>
</ul>
</li>
<li><a href="#org6eb1b7b">2. Programming in Lensor Glint</a>
<ul>
<li><a href="#orgd8ab58a">2.1. Introduction, Overview</a>
<ul>
<li><a href="#org0c18820">2.1.1. History</a></li>
<li><a href="#org5e03ac2">2.1.2. Example Program</a></li>
<li><a href="#orgfa71502">2.1.3. Program Structure</a></li>
<li><a href="#org7624dce">2.1.4. Glint Exercise</a></li>
</ul>
</li>
<li><a href="#orgc35a6d2">2.2. Simple Values</a>
<ul>
<li><a href="#org217299a">2.2.1. Integers</a></li>
<li><a href="#org1c27866">2.2.2. Bytes</a></li>
<li><a href="#org6917ab0">2.2.3. Boolean</a></li>
<li><a href="#org3f62ab3">2.2.4. Strings</a></li>
</ul>
</li>
<li><a href="#org26f65c2">2.3. Variables</a>
<ul>
<li><a href="#org9d4f0d3">2.3.1. Declaration Forms</a></li>
<li><a href="#org1aa06e0">2.3.2. Type Decay</a></li>
<li><a href="#orgbd29815">2.3.3. Scopes</a></li>
<li><a href="#org824419a">2.3.4. Assignment</a></li>
<li><a href="#org02493bf">2.3.5. Glint Exercise</a></li>
</ul>
</li>
<li><a href="#orgb4bc2f9">2.4. Basic Expressions</a>
<ul>
<li><a href="#org74d0904">2.4.1. Arithmetic</a></li>
<li><a href="#org5a42846">2.4.2. Bitwise</a></li>
<li><a href="#orgd7c7094">2.4.3. Implicit Casting</a></li>
<li><a href="#orge4b301e">2.4.4. Explicit Casting</a></li>
<li><a href="#org340d117">2.4.5. Glint Exercise</a></li>
</ul>
</li>
<li><a href="#orgf96dd2c">2.5. Glint's Print</a>
<ul>
<li><a href="#org9a4d6d0">2.5.1. Glint Exercise</a></li>
</ul>
</li>
<li><a href="#org0f6d6f8">2.6. Arrays</a>
<ul>
<li><a href="#orgdd80297">2.6.1. Fixed Arrays</a></li>
<li><a href="#org735c73a">2.6.2. Dynamic Arrays</a></li>
<li><a href="#orgae47181">2.6.3. Array Views</a></li>
</ul>
</li>
<li><a href="#org47ec9b4">2.7. Conditionals and Control Flow</a>
<ul>
<li><a href="#orge9105fb">2.7.1. <code>if</code></a></li>
<li><a href="#org46629ab">2.7.2. <code>while</code></a></li>
<li><a href="#org12abff1">2.7.3. <code>for</code></a></li>
<li><a href="#orgc6e44be">2.7.4. <code>cfor</code></a></li>
<li><a href="#org480b54a">2.7.5. <code>match</code></a></li>
</ul>
</li>
<li><a href="#orgbd77233">2.8. Declared Types</a>
<ul>
<li><a href="#org837b97a">2.8.1. Structs</a></li>
<li><a href="#org2dd7037">2.8.2. Unions</a></li>
<li><a href="#orgc6863f5">2.8.3. Enumerations</a></li>
<li><a href="#org92ba4ee">2.8.4. Sums</a></li>
</ul>
</li>
<li><a href="#org5d5cb6a">2.9. Basic Functions</a>
<ul>
<li><a href="#orgd31d814">2.9.1. Function Attributes</a></li>
</ul>
</li>
<li><a href="#orgdee2e20">2.10. Pointers and References</a></li>
<li><a href="#orgebaaf0d">2.11. Templates</a></li>
<li><a href="#org2aa135f">2.12. Function Overloading</a></li>
<li><a href="#orgfdc04da">2.13. Operator Overloading</a></li>
<li><a href="#org55d4405">2.14. Templated Functions and Templated Types</a></li>
<li><a href="#orgb81cb90">2.15. Modules</a>
<ul>
<li><a href="#org0f39d67">2.15.1. Writing A Module Vs A Program</a></li>
<li><a href="#orgc3f4204">2.15.2. Exporting Variables</a></li>
<li><a href="#orgd31f863">2.15.3. Importing Modules</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcc7a522">3. Types</a>
<ul>
<li><a href="#org5de6620">3.1. Built-in Types</a></li>
<li><a href="#org2d95e87">3.2. FFI Types</a></li>
<li><a href="#orgd08cf5b">3.3. Arbitrary Integers</a></li>
<li><a href="#orgb56876b">3.4. Types with One Element</a>
<ul>
<li><a href="#org5450bb4">3.4.1. Pointers</a></li>
<li><a href="#orgc835363">3.4.2. References</a></li>
</ul>
</li>
<li><a href="#orgce3a3a1">3.5. Composite Types</a>
<ul>
<li><a href="#orgc46548c">3.5.1. Struct Types</a></li>
<li><a href="#org4f67000">3.5.2. Union Types</a></li>
<li><a href="#org2ed5bf7">3.5.3. Sum Types</a></li>
</ul>
</li>
<li><a href="#org6942970">3.6. <code>sizeof</code> and <code>alignof</code></a>
<ul>
<li><a href="#org5197776">3.6.1. On bits vs bytes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1516bcb">4. Postface</a>
<ul>
<li><a href="#orga8a72b6">4.1. Example Programs</a>
<ul>
<li><a href="#org5719436">4.1.1. Hello, World!</a></li>
<li><a href="#orga632809">4.1.2. Factorial</a></li>
<li><a href="#org973c8f1">4.1.3. Recursive Fibonacci</a></li>
<li><a href="#orgc96fd19">4.1.4. Euclid GCD</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
