docs/thebook.html
<div id="outline-container-org2b7dc99" class="outline-2">
<h2 id="org2b7dc99"><span class="section-number-2">1.</span> Preface</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3768f01" class="outline-3">
<h3 id="org3768f01"><span class="section-number-3">1.1.</span> Hardware</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Glint is a programming language. This book is meant to teach it (at least somewhat). A programming language is not useful in a vacuum (literally or figuratively); a programming language is a language that allows a programmer to instruct a computer with what to do (and when to do it).
</p>

<p>
A computer is a broad term, but, for the most part, simply refers to a machine that does "work" via a sequence of operations on binary (on or off) values. This sequence of operations is called <i>code</i>. A collection of code that a computer may run is called a <i>program</i>. So, a program is a collection of code, and code is a sequence of operations that tells the computer what to do.
</p>

<p>
A program <i>starts</i> at a specific point (usually called the entry point). A program is not required to end explicitly, and there are various routes through which a program may end up not running anymore. A program is said to be <i>running</i> on a given computer when operations from that program's code are currently executing on that computer.
</p>

<p>
A computer has to do operations <i>on</i> something. That is, an addition operation isn't useful unless you are actually operating on meaningful values. In the real world, computers have all sorts of different hardware to make this happen (i.e. CPU registers, ALUs, etc.), but we won't get into all of that right now.
</p>

<p>
For now, you just need to learn about something called <i>memory</i>. A computer has to operate on values, and store the result somewhere; it also has to store code, and keep track of it's place. Computers often store those values in their <i>memory</i> (so they can recall it later).
</p>

<p>
A computer's memory may be implemented in the real world in all sorts of ways with differing amounts of limitations (i.e. size, speed, etc.), but the most important takeaway is that, while a computer's memory is made up of binary <i>bits</i> (values that may only be on or off), it is addressed via <i>bytes</i>. In hardware, a byte (the minimum addressable unit in memory) is <i>usually</i> eight bits.
</p>

<pre class="example" id="org7749bfd">
MEMORY
| off on  off off off on  off on | ...
| BYTE 0                         | BYTE 1
</pre>

<p>
In the example above, each <code>off</code> and <code>on</code> represents a bit (an actual stored value in memory that is either <code>on</code> or <code>off</code>). Every eight bits is labeled as a <code>byte</code>. If we were to access any value seen above within the computer's memory, we would do so by first <i>loading</i> the zero-eth byte from memory.
</p>

<p>
To <code>load</code> from memory means to copy the relevant set of bits from memory. Loading requires a memory address: the index of the byte we'd like to load.
</p>

<p>
The opposite of <i>loading from</i> memory is <i>storing into</i> memory. A value (or values) may be stored into memory, such that further loads from that memory result in the stored value(s). Because loading and storing both work with memory, they have the same limitations of not working directly on bits, but on sets of bits called <i>bytes</i>.
</p>

<p>
The operations that a computer performs (or, the <i>code</i> that a computer <i>executes</i>) operate directly on sets of bit values (on or off). These values may be written to or loaded from memory for later use/re-use.
</p>

<p>
As we touched on earlier, even a computer's code is stored in it's own memory. That is, a computer's operations are encoded in a binary format (such that they may be represented by values that may only be <code>on</code> or <code>off</code>), and those binary values are stored into the computer's memory. When the computer is started, the computer loads an operation from it's memory, executes it, and repeats. The computer keeps track of where in it's memory it is executing via a <i>program counter</i>. The program counter is also sometimes known as an <i>instruction pointer</i>. The program counter simply keeps track of which byte within memory the current operation is stored at. When the operation is finished, the computer may look at the next byte within memory to find the next operation.
</p>

<p>
There is also a more permanent form of memory known as <i>storage</i>. A computer's storage is, like memory, a set of binary values (on or off). In an ideal world, memory and storage wouldn't be different. In the real world, storage is much slower (as it solves a different physical problem; it doesn't just store bit values while the computer is on, it stores them even without power). For the most part, computer <i>files</i> are meaningful, named portions of a computer's storage.
</p>
</div>
</div>
