documentation/glint/thebook.txt

  Glint is a programming language. This book is meant to teach it (at
  least somewhat). A programming language is not useful in a vacuum
  (literally or figuratively); a programming language is a language that
  allows a programmer to instruct a computer with what to do (and when
  to do it).

  A computer is a broad term, but, for the most part, simply refers to a
  machine that does "work" via a sequence of operations on binary (on or
  off) values. This sequence of operations is called /code/. A
  collection of code that a computer may run is called a /program/. So,
  a program is a collection of code, and code is a sequence of
  operations that tells the computer what to do.

  A program /starts/ at a specific point (usually called the entry
  point). A program is not required to end explicitly, and there are
  various routes through which a program may end up not running
  anymore. A program is said to be /running/ on a given computer when
  operations from that program's code are currently executing on that
  computer.

  A computer has to do operations /on/ something. That is, an addition
  operation isn't useful unless you are actually operating on meaningful
  values. In the real world, computers have all sorts of different
  hardware to make this happen (i.e. CPU registers, ALUs, etc.), but we
  won't get into all of that right now.

  For now, you just need to learn about something called /memory/. A
  computer has to operate on values, and store the result somewhere; it
  also has to store code, and keep track of it's place. Computers often
  store those values in their /memory/ (so they can recall it later).

  A computer's memory may be implemented in the real world in all sorts
  of ways with differing amounts of limitations (i.e. size, speed,
  etc.), but the most important takeaway is that, while a computer's
  memory is made up of binary /bits/ (values that may only be on or
  off), it is addressed via /bytes/. In hardware, a byte (the minimum
  addressable unit in memory) is /usually/ eight bits.

  ,----
  | MEMORY
  | | off on  off off off on  off on | ...
  | | BYTE 0                         | BYTE 1
  `----

  In the example above, each `off' and `on' represents a bit (an actual
  stored value in memory that is either `on' or `off'). Every eight bits
  is labeled as a `byte'. If we were to access any value seen above
  within the computer's memory, we would do so by first /loading/ the
  zero-eth byte from memory.

  To `load' from memory means to copy the relevant set of bits from
  memory. Loading requires a memory address: the index of the byte we'd
  like to load.

  The opposite of /loading from/ memory is /storing into/ memory. A
  value (or values) may be stored into memory, such that further loads
  from that memory result in the stored value(s). Because loading and
  storing both work with memory, they have the same limitations of not
  working directly on bits, but on sets of bits called /bytes/.

  The operations that a computer performs (or, the /code/ that a
  computer /executes/) operate directly on sets of bit values (on or
  off). These values may be written to or loaded from memory for later
  use/re-use.

  As we touched on earlier, even a computer's code is stored in it's own
  memory. That is, a computer's operations are encoded in a binary
  format (such that they may be represented by values that may only be
  `on' or `off'), and those binary values are stored into the computer's
  memory. When the computer is started, the computer loads an operation
  from it's memory, executes it, and repeats. The computer keeps track
  of where in it's memory it is executing via a /program counter/. The
  program counter is also sometimes known as an /instruction
  pointer/. The program counter simply keeps track of which byte within
  memory the current operation is stored at. When the operation is
  finished, the computer may look at the next byte within memory to find
  the next operation.

  There is also a more permanent form of memory known as /storage/. A
  computer's storage is, like memory, a set of binary values (on or
  off). In an ideal world, memory and storage wouldn't be different. In
  the real world, storage is much slower (as it solves a different
  physical problem; it doesn't just store bit values while the computer
  is on, it stores them even without power). For the most part, computer
  /files/ are meaningful, named portions of a computer's storage.


1.2 Software
~~~~~~~~~~~~
