documentation/glint/thebook.org
** Software

Now that you know what a computer is, and a little bit about how a computer functions, we can now learn some basic conventions about how all modern computers use that hardware to do useful things.

Most computers come with code in their memory that may not ever be changed; it is locked into the hardware (physical parts of the computer machine). This code is called /firmware/, since it is bound to the physical hardware, yet it is still able to be changed without building a new physical chip. A computer's firmware usually handles doing initialisation procedures when the computer turns on, getting the computer to a known state. It does this so that the user of the computer may write software with a known starting state (it'd be quite difficult to guess where the computer has started executing code at, if the program counter's value was random every time the computer was started).

That code that the user runs on their computer is known as /software/. Most computers these days come with a conventional piece of software known as an /operating system/ (often abbreviated /OS/). An /OS/ is software that deals with the specifics of the particular hardware, such that /it/ may provide a /more/ known starting state to /other/ software. An OS usually consists of a kernel program that "talks" to the hardware; in reality, it does whatever is needed to make hardware do a given operation whenever software requests that operation be completed (no actual "talking" involved).

The programs that an OS runs are usually called "user programs", and the known state that the OS provides to software called "userspace". User programs are said to run within userspace.

Glint is a programming language meant to write user programs, so, Glint code runs within userspace of some OS on some computer. This is important to understand how to get the computer to do what you want it to do. /If you want to shoot an arrow and hit a target, you have to know where you are standing./

** Tooling

# Compilers and linkers, object and executable files.

Now, the weird part is that we actually /use/ computers to do (or at least help with) the work of producing code. This means there is actually /software/ we use when writing /software/.

One such piece of software is a /compiler/ program. A compiler produces code in a file, given some input. The format that a compiler inputs and outputs is not set in stone, and varies depending on your particular OS, hardware, etc. A compiler is usually referred to by the /language/ the compiler accepts as input. For example, a /C compiler/ would be a compiler that takes as input the language /C/, and outputs code in some other (possibly machine-ready) format.

A compiler will often tell you when a program is ill-formed; a good compiler will tell you where and how. An ill-formed program is like a sentence that doesn't follow grammar rules: the sentence will never convey any meaning until the rules are followed, as it is fundamentally flawed. Some problems in programs mean the program will never work; these are usually called /errors/. Other problems are just things that are likely to be misinterpreted or often cause confusion (like a sentence that starts with "Because"); these are usually called /warnings/.

The file a compiler produces is called an /object/ file. An object file is a type of file that stores code and data, and necessary information about that code and data.

An object file must be turned into an executable file via a /linker/ program before a computer may load it into memory and actually execute the operations. An executable file is just a binary format that an OS supports loading, like /the Executable and Linkable Format (ELF)/. A linker's main job is to convert named portions of memory to actual memory addresses.

* Programming in Lensor Glint

NOTE: Glint is a language, Lensor is the specification of the language described by this book.

RECOMMENDATION TO READERS: It is my belief that you will learn faster, and better understand the concepts presented, if you have a computer with /some/ implementation of a Glint compiler present on the system. As you read, test yourself by trying to write Glint programs that you believe to follow the rules as you currently understand them. The feedback the compiler gives you when trying to build the programs you write is invaluable in quickly correcting small errors in your current mental model.

I recommend GNU Emacs (or Vim) as an editor, but you may use whatever editor tooling you find the most comfortable.

** Introduction, Overview

