docs/thebook.html
<div id="outline-container-org288134b" class="outline-3">
<h3 id="org288134b"><span class="section-number-3">1.2.</span> Software</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Now that you know what a computer is, and a little bit about how a computer functions, we can now learn some basic conventions about how all modern computers use that hardware to do useful things.
</p>

<p>
Most computers come with code in their memory that may not ever be changed; it is locked into the hardware (physical parts of the computer machine). This code is called <i>firmware</i>, since it is bound to the physical hardware, yet it is still able to be changed without building a new physical chip. A computer's firmware usually handles doing initialisation procedures when the computer turns on, getting the computer to a known state. It does this so that the user of the computer may write software with a known starting state (it'd be quite difficult to guess where the computer has started executing code at, if the program counter's value was random every time the computer was started).
</p>

<p>
That code that the user runs on their computer is known as <i>software</i>. Most computers these days come with a conventional piece of software known as an <i>operating system</i> (often abbreviated <i>OS</i>). An <i>OS</i> is software that deals with the specifics of the particular hardware, such that <i>it</i> may provide a <i>more</i> known starting state to <i>other</i> software. An OS usually consists of a kernel program that "talks" to the hardware; in reality, it does whatever is needed to make hardware do a given operation whenever software requests that operation be completed (no actual "talking" involved).
</p>

<p>
The programs that an OS runs are usually called "user programs", and the known state that the OS provides to software called "userspace". User programs are said to run within userspace.
</p>

<p>
Glint is a programming language meant to write user programs, so, Glint code runs within userspace of some OS on some computer. This is important to understand how to get the computer to do what you want it to do. <i>If you want to shoot an arrow and hit a target, you have to know where you are standing.</i>
</p>
</div>
</div>
<div id="outline-container-org2d84d15" class="outline-3">
<h3 id="org2d84d15"><span class="section-number-3">1.3.</span> Tooling</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Now, the weird part is that we actually <i>use</i> computers to do (or at least help with) the work of producing code. This means there is actually <i>software</i> we use when writing <i>software</i>.
</p>

<p>
One such piece of software is a <i>compiler</i> program. A compiler produces code in a file, given some input. The format that a compiler inputs and outputs is not set in stone, and varies depending on your particular OS, hardware, etc. A compiler is usually referred to by the <i>language</i> the compiler accepts as input. For example, a <i>C compiler</i> would be a compiler that takes as input the language <i>C</i>, and outputs code in some other (possibly machine-ready) format.
</p>

<p>
A compiler will often tell you when a program is ill-formed; a good compiler will tell you where and how. An ill-formed program is like a sentence that doesn't follow grammar rules: the sentence will never convey any meaning until the rules are followed, as it is fundamentally flawed. Some problems in programs mean the program will never work; these are usually called <i>errors</i>. Other problems are just things that are likely to be misinterpreted or often cause confusion (like a sentence that starts with "Because"); these are usually called <i>warnings</i>.
</p>

<p>
The file a compiler produces is called an <i>object</i> file. An object file is a type of file that stores code and data, and necessary information about that code and data.
</p>

<p>
An object file must be turned into an executable file via a <i>linker</i> program before a computer may load it into memory and actually execute the operations. An executable file is just a binary format that an OS supports loading, like <i>the Executable and Linkable Format (ELF)</i>. A linker's main job is to convert named portions of memory to actual memory addresses.
</p>
</div>
</div>
</div>
<div id="outline-container-org6eb1b7b" class="outline-2">
<h2 id="org6eb1b7b"><span class="section-number-2">2.</span> Programming in Lensor Glint</h2>
<div class="outline-text-2" id="text-2">
<p>
NOTE: Glint is a language, Lensor is the specification of the language described by this book.
</p>

<p>
RECOMMENDATION TO READERS: It is my belief that you will learn faster, and better understand the concepts presented, if you have a computer with <i>some</i> implementation of a Glint compiler present on the system. As you read, test yourself by trying to write Glint programs that you believe to follow the rules as you currently understand them. The feedback the compiler gives you when trying to build the programs you write is invaluable in quickly correcting small errors in your current mental model.
</p>

<p>
I recommend GNU Emacs (or Vim) as an editor, but you may use whatever editor tooling you find the most comfortable.
</p>
</div>
<div id="outline-container-orgd8ab58a" class="outline-3">
<h3 id="orgd8ab58a"><span class="section-number-3">2.1.</span> Introduction, Overview</h3>
<div class="outline-text-3" id="text-2-1">
</div>
