documentation/glint/thebook.org
*** History

Glint started in 2023 when Lens_r decided he wanted to make a compiler, from scratch, for fun. That compiler needed to compile a language, and so he made one up. At first, it had no name, and was referred to as "the language the FUNCompiler compiles"; as you may have guessed, that grew tedious rather fast, and we needed a name.

That's when Glint got it's name: /Intercept/. Yes, it was named something else for the first year or so. It was renamed Glint when the language itself was cleaned up and made more opinionated toward important design goals, and the language kind of outgrew it's initial version, looking nothing like it used to (and as such, felt deserving of a new name).

The hope is that, even if this language doesn't change your perceptions entirely, or blow your mind, you'll be able to see a glint of promise in an otherwise dark world =:^)=.

*** Example Program

#+begin_src glint
  ;; Comments may be placed in the source to explain the program and/or make
  ;; it easier to understand. They begin with ;; and end with a newline or
  ;; end of file (EOF).

  ;; Variable Declaration
  my/array : [byte];

  my/array += `8`; ;; append
  my/array ~= `5`; ;; prepend

  ;; Iteration
  for b in my/array,
    b += 1;

  ;; Emit "69".
  print my/array, `\n`;

  ;; Some Glint tooling (namely glintdoc) makes use of special comments that
  ;; precede declarations. They usually contain @ directives.

  ;; @returns the answer to the universe.
  my/cool-function! : int()
    42;

  ;; Emit "420".
  print 10 my/cool-function!, `\n`;

  ;; The final expression in the program is returned.
  69;
#+end_src

*** Program Structure

A Glint program consists of:
- Header :: The first portion of the file designates module status and imported dependencies.
- Comments :: Non-code portions of the file that are used to describe, annotate, and document the code portions of the file. Comments begin at =;;= and go until a newline or EOF.
- Expressions :: Code portions of the file that are used to tell the computer what to do; they are said to "return" a value of some type upon evaluation/execution.

*** Glint Exercise

# An exercise for the reader to explore and ensure their knowledge on the very basics of Glint program structure. The idea is to ensure they can read the examples coming up. I think the idea is to give an example program, and provide a small, five-question quiz for the reader to test their knowledge. i.e. "what is the first word of the 4th comment", "what is the first expression", etc.

#+begin_src glint -n
  ;; Declare some variables with initial values.
  a : int 42;
  b : byte 27;

  ;; @returns the sum of parameters x and y.
  foo : int(x : int, y : int)
    x + y; ;; adds x and y

  ;; Invocation of function foo with parameters a and b.
  foo a, b;
#+end_src

The following questions relate to the above example. If you don't know the answer to one, just keep reading and move on, it's okay; you can come back whenever you are ready.

1. On what line does the first /expression/ appear?
  # NOTE: answer drawers are not included in the export.
  # The idea is that I (or a program) will go through and write the answers
  # in the back of the book.
  :answer:
  2
  :end:

2. On what line does the comment with an @ directive appear?
  :answer:
  5
  :end:

3. Is there an expression on line 7?
  :answer:
  yes
  :end:

4. What would the result of the entire program be?
  :answer:
  69
  OR a + b
  :end:

5. Is there a comment on line 7?
  :answer:
  yes
  :end:

Extra credit:

6. How many parameters does =foo= take?
  :answer:
  2
  :end:

7. What kind of type is =foo= of?
  :answer:
  Function
  :end:

** Simple Values

or, Literals and Constants,
or, Self-evaluating Expressions.

*** Integers

Glint supports decimal, hexadecimal, octal, and binary integer literal formats; all except decimal are accessible through a special prefix that begins with =0=. A decimal number literal may not begin with =0=.

A hexadecimal number literal is prefixed with =0x=. =0xf= has the value of =f= in hexadecimal, or =15= in decimal.

An octal number literal is prefixed with =0o=. =0o25= has the value of =25= in octal, or =21= in decimal.

A binary number literal is prefixed with =0b=. =0b10= has the value of =10= in binary, or =2= in decimal.

Integer literals are always of =int= type.

*** Fractionals

Glint supports decimal fractional literal formats. The whole part of a decimal fractional literal may not begin with =0=.

#+begin_src glint
  0.0;
  0.5;
  1.0;
  1.0005;
  82921.5;
  12398.812;
#+end_src

Fractional literals are always of =float= type.

