docs/thebook.html
<div id="outline-container-org0c18820" class="outline-4">
<h4 id="org0c18820"><span class="section-number-4">2.1.1.</span> History</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Glint started in 2023 when Lens_r decided he wanted to make a compiler, from scratch, for fun. That compiler needed to compile a language, and so he made one up. At first, it had no name, and was referred to as "the language the FUNCompiler compiles"; as you may have guessed, that grew tedious rather fast, and we needed a name.
</p>

<p>
That's when Glint got it's name: <i>Intercept</i>. Yes, it was named something else for the first year or so. It was renamed Glint when the language itself was cleaned up and made more opinionated toward important design goals, and the language kind of outgrew it's initial version, looking nothing like it used to (and as such, felt deserving of a new name).
</p>

<p>
The hope is that, even if this language doesn't change your perceptions entirely, or blow your mind, you'll be able to see a glint of promise in an otherwise dark world <code>:^)</code>.
</p>
</div>
</div>
<div id="outline-container-org5e03ac2" class="outline-4">
<h4 id="org5e03ac2"><span class="section-number-4">2.1.2.</span> Example Program</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-glint"><span class="org-comment">;; Comments may be placed in the source to explain the program and/or make</span>
<span class="org-comment">;; it easier to understand. They begin with ;; and end with a newline or</span>
<span class="org-comment">;; end of file (EOF).</span>

<span class="org-comment">;; Some Glint tooling (namely glintdoc) makes use of special comments that</span>
<span class="org-comment">;; precede declarations. They usually contain @ directives.</span>

foo <span class="org-operator">:</span> <span class="org-type">int</span>;

<span class="org-comment">;; @returns updated value of 'foo'.</span>
<span class="org-comment">;; @see foo;</span>
<span class="org-function-name">getset_foo</span> <span class="org-operator">:</span> <span class="org-type">int</span><span class="org-delimiter">()</span>
  foo <span class="org-operator">:=</span> <span class="org-operator">++</span>foo;

<span class="org-comment">;; The final expression in the program is returned.</span>
<span class="org-number">69</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfa71502" class="outline-4">
<h4 id="orgfa71502"><span class="section-number-4">2.1.3.</span> Program Structure</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
A Glint program consists of:
</p>
<dl class="org-dl">
<dt>Header</dt><dd>The first portion of the file designates module status and imported dependencies.</dd>
<dt>Comments</dt><dd>Non-code portions of the file that are used to describe, annotate, and document the code portions of the file. Comments begin at <code>;;</code> and go until a newline or EOF.</dd>
<dt>Expressions</dt><dd>Code portions of the file that are used to tell the computer what to do; they are said to "return" a value of some type upon evaluation/execution.</dd>
</dl>
</div>
</div>
<div id="outline-container-org7624dce" class="outline-4">
<h4 id="org7624dce"><span class="section-number-4">2.1.4.</span> Glint Exercise</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">
<pre class="src src-glint"><span class="linenr"> 1: </span><span class="org-comment">;; Declare some variables with initial values.</span>
<span class="linenr"> 2: </span>a <span class="org-operator">:</span> <span class="org-type">int</span> <span class="org-number">42</span>;
<span class="linenr"> 3: </span>b <span class="org-operator">:</span> <span class="org-type">byte</span> <span class="org-number">27</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span class="org-comment">;; @returns the sum of parameters x and y.</span>
<span class="linenr"> 6: </span><span class="org-function-name">foo</span> <span class="org-operator">:</span> <span class="org-type">int</span><span class="org-delimiter">(</span>x <span class="org-operator">:</span> <span class="org-type">int</span>, y <span class="org-operator">:</span> <span class="org-type">int</span><span class="org-delimiter">)</span>
<span class="linenr"> 7: </span>  x <span class="org-operator">+</span> y; <span class="org-comment">;; adds x and y</span>
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span class="org-comment">;; Invocation of function foo with parameters a and b.</span>
<span class="linenr">10: </span>foo a, b;
</pre>
</div>

<p>
The following questions relate to the above example. If you don't know the answer to one, just keep reading and move on, it's okay; you can come back whenever you are ready.
</p>

<ol class="org-ol">
<li>On what line does the first <i>expression</i> appear?</li>

<li>On what line does the comment with an @ directive appear?</li>

<li>Is there an expression on line 7?</li>

<li>What would the result of the entire program be?</li>

<li>Is there a comment on line 7?</li>
</ol>

<p>
Extra credit:
</p>

<ol class="org-ol">
<li>How many parameters does <code>foo</code> take?</li>

<li>What kind of type is <code>foo</code> of?</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgc35a6d2" class="outline-3">
<h3 id="orgc35a6d2"><span class="section-number-3">2.2.</span> Simple Values</h3>
<div class="outline-text-3" id="text-2-2">
<p>
or, Literals and Constants,
or, Self-evaluating Expressions.
</p>
</div>
<div id="outline-container-org217299a" class="outline-4">
<h4 id="org217299a"><span class="section-number-4">2.2.1.</span> Integers</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Glint supports decimal, hexadecimal, octal, and binary integer literal formats; all except decimal are accessible through a special prefix that begins with <code>0</code>. A decimal number literal may not begin with <code>0</code>.
</p>

<p>
A hexadecimal number literal is prefixed with <code>0x</code>. <code>0xf</code> has the value of <code>f</code> in hexadecimal, or <code>15</code> in decimal.
</p>

<p>
An octal number literal is prefixed with <code>0o</code>. <code>0o25</code> has the value of <code>25</code> in octal, or <code>21</code> in decimal.
</p>

<p>
A binary number literal is prefixed with <code>0b</code>. <code>0b10</code> has the value of <code>10</code> in binary, or <code>2</code> in decimal.
</p>

<p>
Integer literals are always of <code>int</code> type.
</p>
</div>
</div>
