documentation/glint/thebook.txt

  Glint started in 2023 when Lens_r decided he wanted to make a
  compiler, from scratch, for fun. That compiler needed to compile a
  language, and so he made one up. At first, it had no name, and was
  referred to as "the language the FUNCompiler compiles"; as you may
  have guessed, that grew tedious rather fast, and we needed a name.

  That's when Glint got it's name: /Intercept/. Yes, it was named
  something else for the first year or so. It was renamed Glint when the
  language itself was cleaned up and made more opinionated toward
  important design goals, and the language kind of outgrew it's initial
  version, looking nothing like it used to (and as such, felt deserving
  of a new name).

  The hope is that, even if this language doesn't change your
  perceptions entirely, or blow your mind, you'll be able to see a glint
  of promise in an otherwise dark world `:^)'.


2.1.2 Example Program
---------------------

  ,----
  | ;; Comments may be placed in the source to explain the program and/or make
  | ;; it easier to understand. They begin with ;; and end with a newline or
  | ;; end of file (EOF).
  | 
  | ;; Variable Declaration
  | my/array : [byte];
  | 
  | my/array += `8`; ;; append
  | my/array ~= `5`; ;; prepend
  | 
  | ;; Iteration
  | for b in my/array,
  |   b += 1;
  | 
  | ;; Emit "69".
  | print my/array, `\n`;
  | 
  | ;; Some Glint tooling (namely glintdoc) makes use of special comments that
  | ;; precede declarations. They usually contain @ directives.
  | 
  | ;; @returns the answer to the universe.
  | my/cool-function! : int()
  |   42;
  | 
  | ;; Emit "420".
  | print 10 my/cool-function!, `\n`;
  | 
  | ;; The final expression in the program is returned.
  | 69;
  `----


2.1.3 Program Structure
-----------------------

  A Glint program consists of:
  Header
        The first portion of the file designates module status and
        imported dependencies.
  Comments
        Non-code portions of the file that are used to describe,
        annotate, and document the code portions of the file. Comments
        begin at `;;' and go until a newline or EOF.
  Expressions
        Code portions of the file that are used to tell the computer
        what to do; they are said to "return" a value of some type upon
        evaluation/execution.


2.1.4 Glint Exercise
--------------------

  ,----
  |  1  ;; Declare some variables with initial values.
  |  2  a : int 42;
  |  3  b : byte 27;
  |  4  
  |  5  ;; @returns the sum of parameters x and y.
  |  6  foo : int(x : int, y : int)
  |  7    x + y; ;; adds x and y
  |  8  
  |  9  ;; Invocation of function foo with parameters a and b.
  | 10  foo a, b;
  `----

  The following questions relate to the above example. If you don't know
  the answer to one, just keep reading and move on, it's okay; you can
  come back whenever you are ready.

  1. On what line does the first /expression/ appear?

  2. On what line does the comment with an @ directive appear?

  3. Is there an expression on line 7?

  4. What would the result of the entire program be?

  5. Is there a comment on line 7?

  Extra credit:

  1. How many parameters does `foo' take?

  2. What kind of type is `foo' of?


2.2 Simple Values
~~~~~~~~~~~~~~~~~

  or, Literals and Constants, or, Self-evaluating Expressions.


2.2.1 Integers
--------------

  Glint supports decimal, hexadecimal, octal, and binary integer literal
  formats; all except decimal are accessible through a special prefix
  that begins with `0'. A decimal number literal may not begin with `0'.

  A hexadecimal number literal is prefixed with `0x'. `0xf' has the
  value of `f' in hexadecimal, or `15' in decimal.

  An octal number literal is prefixed with `0o'. `0o25' has the value of
  `25' in octal, or `21' in decimal.

  A binary number literal is prefixed with `0b'. `0b10' has the value of
  `10' in binary, or `2' in decimal.

  Integer literals are always of `int' type.


2.2.2 Bytes
-----------
