docs/thebook.html
<div id="outline-container-org1c27866" class="outline-4">
<h4 id="org1c27866"><span class="section-number-4">2.2.2.</span> Bytes</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Glint makes no distinction between character and integer data types (unlike Pascal, and like C).
</p>

<p>
Glint provides a way to get the encoded byte value of a character as an integer value in the program, and that is to wrap the character in <code>`</code> (back-ticks).
</p>

<p>
<code>`0`</code> is equivalent to <code>48</code>.
</p>

<p>
Often, it can be messy to have control characters appear in the source code, so Glint provides an "escape" syntax, such that other, non-control characters may represent the control characters.
</p>

<p>
Relevant escape characters include <code>\n</code> for a line feed, <code>\\</code> for a <code>\</code> (backslash), and <code>\t</code> for a tab stop.
</p>

<p>
Byte literals are always of <code>byte</code> type.
</p>
</div>
</div>
<div id="outline-container-org6917ab0" class="outline-4">
<h4 id="org6917ab0"><span class="section-number-4">2.2.3.</span> Boolean</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Logical values that denote veracity of an expression.
</p>

<p>
<code>true</code> and <code>false</code> keywords to access these values.
</p>

<p>
Boolean values are always of <code>s1</code> (one-bit signed integer) type.
</p>
</div>
</div>
<div id="outline-container-org3f62ab3" class="outline-4">
<h4 id="org3f62ab3"><span class="section-number-4">2.2.4.</span> Strings</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
A string allows the Glint programmer to include (textual) data directly from the source code into the final program as an array of byte values.
</p>

<p>
Inescapable strings are wrapped with <code>'</code> (U+0027, apostrophe), and escape-able strings with <code>"</code> (U+0022, quotation mark).
</p>

<p>
An inescapable string will contain the contents between the two <code>'</code> (apostrophes), verbatim. <b><code>\</code> is not special within an inescapable string.</b> An inescapable string may span any amount of newlines.
</p>

<p>
<code>'foo\﻿n'</code> -&gt; [102, 111, 111, 92, 110, 0]
</p>

<p>
An escape-able string accepts the "escape" syntax that byte literals also accept.
</p>

<p>
<code>"foo\﻿n"</code> -&gt; [102, 111, 111, 10, 0]
</p>

<p>
For historical reasons, and compatibility with other languages and tooling, Glint strings have a NUL byte (value of zero) appended. So, the empty string literal <code>''</code> contains the bytes <code>[0]</code>, and is of type <code>[byte 1]</code>.
</p>

<p>
String literals are always a fixed array of <code>byte</code>, with the length set long enough to store the string and the implicit NUL byte.
</p>
</div>
</div>
</div>
<div id="outline-container-org26f65c2" class="outline-3">
<h3 id="org26f65c2"><span class="section-number-3">2.3.</span> Variables</h3>
<div class="outline-text-3" id="text-2-3">
<p>
A variable is a name we give to some Glint construct. In most cases, a variable refers to data at some address in memory; as such, it is sort of like a labeled, specialty box. The box may only contain the type of data the box is declared to contain, and the box may be referenced by it's name. Any value may go in the box, as long as it fits both in the box and through the opening.
</p>

<p>
A variable is a named location in the computer's memory at the time of evaluation.
You may store data at this named location for easier retrieval later on. The data is stored on a computer, and, as such, is in a binary format (just bits). However, Glint makes use of types of data that the hardware cannot understand, allowing the Glint programmer to write more idiomatic source code. You can think of types as an interpretation of the binary bits that are actually on your computer hardware when the code is running. The type of data that is stored at this location is declared by the programmer either explicitly or implicitly in a <i>declaration expression</i>.
</p>
</div>
<div id="outline-container-org9d4f0d3" class="outline-4">
<h4 id="org9d4f0d3"><span class="section-number-4">2.3.1.</span> Declaration Forms</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
A declaration expression may take on several different <i>forms</i>. All of these forms accomplish the same thing (declaring a variable), but in different ways and with different requirements.
</p>

<p>
The most standard form of declaration expression is an explicitly-typed variable.
</p>
<div class="org-src-container">
<pre class="src src-glint">x <span class="org-operator">:</span> <span class="org-type">int</span>;
</pre>
</div>

<p>
This sort of expression may be read as, "x is an integer".
</p>

<p>
This form may be built upon to include an initializing expression, placed directly after the type expression. In this way, it is equivalent in syntax to an explicit cast expression preceded by an identifier.
</p>
<div class="org-src-container">
<pre class="src src-glint">x <span class="org-operator">:</span> <span class="org-type">int</span> <span class="org-number">69</span>;
</pre>
</div>

<p>
This may be read as, "x is an integer with the value sixty-nine".
</p>

<p>
There is another form of declaration, though, that allows us to shorten a lot of code, and reduce duplicated type names in declarations: the type-inferred declaration expression form.
</p>
<div class="org-src-container">
<pre class="src src-glint">x <span class="org-operator">::</span> <span class="org-number">69</span>;
</pre>
</div>

<p>
This may be read as "x has the value of 69". The type of x will be set to whatever the type of the initializing expression is (in this case, <code>int</code>).
</p>

<p>
<b>Uninitialized variables are default initialized</b>, which, for the most part, means they have a value of zero (except for dynamic arrays, but, we'll get to that).
</p>
</div>
</div>
