documentation/glint/thebook.txt

  Glint makes no distinction between character and integer data types
  (unlike Pascal, and like C).

  Glint provides a way to get the encoded byte value of a character as
  an integer value in the program, and that is to wrap the character in
  ``' (back-ticks).

  ``0`' is equivalent to `48'.

  Often, it can be messy to have control characters appear in the source
  code, so Glint provides an "escape" syntax, such that other,
  non-control characters may represent the control characters.

  Relevant escape characters include `\n' for a line feed, `\\' for a
  `\' (backslash), and `\t' for a tab stop.

  Byte literals are always of `byte' type.


2.2.3 Boolean
-------------

  Logical values that denote veracity of an expression.

  `true' and `false' keywords to access these values.

  Boolean values are always of `s1' (one-bit signed integer) type.


2.2.4 Strings
-------------

  A string allows the Glint programmer to include (textual) data
  directly from the source code into the final program as an array of
  byte values.

  Inescapable strings are wrapped with `'' (U+0027, apostrophe), and
  escape-able strings with `"' (U+0022, quotation mark).

  An inescapable string will contain the contents between the two `''
  (apostrophes), verbatim. *`\' is not special within an inescapable
  string.* An inescapable string may span any amount of newlines.

  `'foo\﻿n'' -> [102, 111, 111, 92, 110, 0]

  An escape-able string accepts the "escape" syntax that byte literals
  also accept.

  `"foo\﻿n"' -> [102, 111, 111, 10, 0]

  For historical reasons, and compatibility with other languages and
  tooling, Glint strings have a NUL byte (value of zero) appended. So,
  the empty string literal `''' contains the bytes `[0]', and is of type
  `[byte 1]'.

  String literals are always a fixed array of `byte', with the length
  set long enough to store the string and the implicit NUL byte.


2.3 Variables
~~~~~~~~~~~~~

  A variable is a name we give to some Glint construct. In most cases, a
  variable refers to data at some address in memory; as such, it is sort
  of like a labeled, specialty box. The box may only contain the type of
  data the box is declared to contain, and the box may be referenced by
  it's name. Any value may go in the box, as long as it fits both in the
  box and through the opening.

  A variable is a named location in the computer's memory at the time of
  evaluation.  You may store data at this named location for easier
  retrieval later on. The data is stored on a computer, and, as such, is
  in a binary format (just bits). However, Glint makes use of types of
  data that the hardware cannot understand, allowing the Glint
  programmer to write more idiomatic source code. You can think of types
  as an interpretation of the binary bits that are actually on your
  computer hardware when the code is running. The type of data that is
  stored at this location is declared by the programmer either
  explicitly or implicitly in a /declaration expression/.


2.3.1 Declaration Forms
-----------------------

  A declaration expression may take on several different /forms/. All of
  these forms accomplish the same thing (declaring a variable), but in
  different ways and with different requirements.

  The most standard form of declaration expression is an
  explicitly-typed variable.
  ,----
  | x : int;
  `----

  This sort of expression may be read as, "x is an integer".

  This form may be built upon to include an initializing expression,
  placed directly after the type expression. In this way, it is
  equivalent in syntax to an explicit cast expression preceded by an
  identifier.
  ,----
  | x : int 69;
  `----

  This may be read as, "x is an integer with the value sixty-nine".

  There is another form of declaration, though, that allows us to
  shorten a lot of code, and reduce duplicated type names in
  declarations: the type-inferred declaration expression form.
  ,----
  | x :: 69;
  `----

  This may be read as "x has the value of 69". The type of x will be set
  to whatever the type of the initializing expression is (in this case,
  `int').

  *Uninitialized variables are default initialized*, which, for the most
   part, means they have a value of zero (except for dynamic arrays,
   but, we'll get to that).


2.3.2 Type Decay
----------------
