documentation/glint/thebook.org
*** Type Decay

One of the more confusing parts of any type system is declaration type decay; as long as you aren't doing anything too weird, you'll never run into problems. But, if you are trying to pass functions as parameters to other functions, it becomes relevant. For now, just understand that some types are quite complex in Glint, but quite simple in the underlying implementation, and that means that sometimes you want the simple underlying implementation rather than all the complexities that come with the Glint type (if that makes any sense).

*** Scopes

A /scope/ is a concept of a meaningful collection of declarations. For example, the body of a function is within a new scope, such that any variable declarations are not accessible from outside the function.

A Glint programmer may open a scope manually by using a block expression; the contents of which is within a new scope.

Whenever a new scope is created (or /opened/), it is given a parent scope; if a name lookup doesn't match in the enclosing scope, the parent will be searched until either the name is found or there are no more parent scopes.

#+begin_src glint
  x : int;

  {
    y : int;
  }

  y; ;; Error! Unknown symbol y'
#+end_src

The scope structure of the above program might look something like the following. (NOTE: Simplification for explanation purposes: leaves out global and top level scope).
#+begin_example
root
|-- x
`--block
   `-- y
#+end_example

When we "exit" the block expression, the scope is exited as well; further expressions are once again within the parent scope.

If we were to lookup =x= from the =block= scope, we would not find it in the enclosing scope, search the parent (=root=), and find it. This means that =x= is accessible from the block scope, and it would not be an error to use it there.

On the contrary, if we were to lookup =y= from the =root= scope, we would again not find it in the enclosing scope; but, there is no parent of the =root= scope, so we are done searching. Because we exhausted the search of scopes and did not find a matching declaration, that means this symbol is not valid at this point in the program. That is why the above use of =y=, outside of the block expression, is invalid.

In Glint, shadowing is not allowed, so you cannot actually declare a variable of the same name as another if both would be valid at that point.

#+begin_src glint
  x : int;
  { x : int; } ;; Error! Redeclaration of 'x'
#+end_src

The following is a non-exhaustive list of expressions which have containing expressions that are parsed in a different scope.

- Block Expression
- If Expression
- Else Clause
- For/CFor
- Function Body
- Each Match Expression

*** Assignment

Assignment is the operation of setting a variable's value, such that further accesses to the variable result in the set value. Assignment uses the =:== operator (like Pascal). Assignment destructively modifies the values in memory associated with the given variable. After assignment, any value that was held in the memory /before/ the assignment is destroyed, and can not be accessed.

#+begin_src glint
  x : int;

  ;; This is an assignment!
  x := 69;
#+end_src

# Mention extended assignment operators i.e. -=

Often, you want to use the variable itself in the calculation of the new value of the variable; there are short-hands for lots of operations mixed with assignment.
#+begin_src glint
  x :: 42;
  x += 27; ;; Now, x = 69
#+end_src

*** Glint Exercise

Exercise Mission
- Recognize declarations of any form.
- Differentiate variable names, types, and initializing expressions.
- Reason about the values variables have at different points in the control flow of the program.

#+begin_src glint
  x : int;
  y : int = 420;

  ;; y := y - x;
  y -= x;

  x := 351;

  z :: y - x;
#+end_src

The following questions relate to the above example.

1. What is the name of the first variable declared?
  :answer:
  x
  :end:

2. How many variables are declared?
  :answer:
  3
  :end:

3. What is the value of variable 'y' when the program starts, and when the program finishes?
  :answer:
  420, 420
  :end:

4. What is the initial value of 'z'?
  :answer:
  69
  :end:

5. What is the type of 'z'?
  :answer:
  int
  OR the common type of 'y' and 'x'
  :end:

6. What is the value of the variable 'x' when the program starts, and when the program finishes?
  :answer:
  0, 351
  :end:

** Basic Expressions

