docs/thebook.html
<div id="outline-container-org1aa06e0" class="outline-4">
<h4 id="org1aa06e0"><span class="section-number-4">2.3.2.</span> Type Decay</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
One of the more confusing parts of any type system is declaration type decay; as long as you aren't doing anything too weird, you'll never run into problems. But, if you are trying to pass functions as parameters to other functions, it becomes relevant. For now, just understand that some types are quite complex in Glint, but quite simple in the underlying implementation, and that means that sometimes you want the simple underlying implementation rather than all the complexities that come with the Glint type (if that makes any sense).
</p>
</div>
</div>
<div id="outline-container-orgbd29815" class="outline-4">
<h4 id="orgbd29815"><span class="section-number-4">2.3.3.</span> Scopes</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
A <i>scope</i> is a concept of a meaningful collection of declarations. For example, the body of a function is within a new scope, such that any variable declarations are not accessible from outside the function.
</p>

<p>
A Glint programmer may open a scope manually by using a block expression; the contents of which is within a new scope.
</p>

<p>
Whenever a new scope is created (or <i>opened</i>), it is given a parent scope; if a name lookup doesn't match in the enclosing scope, the parent will be searched until either the name is found or there are no more parent scopes.
</p>

<div class="org-src-container">
<pre class="src src-glint">x <span class="org-operator">:</span> <span class="org-type">int</span>;

<span class="org-delimiter">{</span>
  y <span class="org-operator">:</span> <span class="org-type">int</span>;
<span class="org-delimiter">}</span>

y; <span class="org-comment">;; Error! Unknown symbol y'</span>
</pre>
</div>

<p>
The scope structure of the above program might look something like the following. (NOTE: Simplification for explanation purposes: leaves out global and top level scope).
</p>
<pre class="example" id="org0128c94">
root
|-- x
`--block
   `-- y
</pre>

<p>
When we "exit" the block expression, the scope is exited as well; further expressions are once again within the parent scope.
</p>

<p>
If we were to lookup <code>x</code> from the <code>block</code> scope, we would not find it in the enclosing scope, search the parent (<code>root</code>), and find it. This means that <code>x</code> is accessible from the block scope, and it would not be an error to use it there.
</p>

<p>
On the contrary, if we were to lookup <code>y</code> from the <code>root</code> scope, we would again not find it in the enclosing scope; but, there is no parent of the <code>root</code> scope, so we are done searching. Because we exhausted the search of scopes and did not find a matching declaration, that means this symbol is not valid at this point in the program. That is why the above use of <code>y</code>, outside of the block expression, is invalid.
</p>

<p>
In Glint, shadowing is not allowed, so you cannot actually declare a variable of the same name as another if both would be valid at that point.
</p>

<div class="org-src-container">
<pre class="src src-glint">x <span class="org-operator">:</span> <span class="org-type">int</span>;
<span class="org-delimiter">{</span> x <span class="org-operator">:</span> <span class="org-type">int</span>; <span class="org-delimiter">}</span> <span class="org-comment">;; Error! Redeclaration of 'x'</span>
</pre>
</div>

<p>
The following is a non-exhaustive list of expressions which have containing expressions that are parsed in a different scope.
</p>

<ul class="org-ul">
<li>Block Expression</li>
<li>If Expression</li>
<li>Else Clause</li>
<li>For/CFor</li>
<li>Function Body</li>
<li>Each Match Expression</li>
</ul>
</div>
</div>
<div id="outline-container-org824419a" class="outline-4">
<h4 id="org824419a"><span class="section-number-4">2.3.4.</span> Assignment</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
Assignment is the operation of setting a variable's value, such that further accesses to the variable result in the set value. Assignment uses the <code>:=</code> operator (like Pascal). Assignment destructively modifies the values in memory associated with the given variable. After assignment, any value that was held in the memory <i>before</i> the assignment is destroyed, and can not be accessed.
</p>

<div class="org-src-container">
<pre class="src src-glint">x <span class="org-operator">:</span> <span class="org-type">int</span>;

<span class="org-comment">;; This is an assignment!</span>
x <span class="org-operator">:=</span> <span class="org-number">69</span>;
</pre>
</div>

<p>
Often, you want to use the variable itself in the calculation of the new value of the variable; there are short-hands for lots of operations mixed with assignment.
</p>
<div class="org-src-container">
<pre class="src src-glint">x <span class="org-operator">::</span> <span class="org-number">42</span>;
x <span class="org-operator">+=</span> <span class="org-number">27</span>; <span class="org-comment">;; Now, x = 69</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org02493bf" class="outline-4">
<h4 id="org02493bf"><span class="section-number-4">2.3.5.</span> Glint Exercise</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
Exercise Mission
</p>
<ul class="org-ul">
<li>Recognize declarations of any form.</li>
<li>Differentiate variable names, types, and initializing expressions.</li>
<li>Reason about the values variables have at different points in the control flow of the program.</li>
</ul>

<div class="org-src-container">
<pre class="src src-glint">x <span class="org-operator">:</span> <span class="org-type">int</span>;
y <span class="org-operator">:</span> <span class="org-type">int</span> <span class="org-operator">=</span> <span class="org-number">420</span>;

<span class="org-comment">;; y := y - x;</span>
y <span class="org-operator">-=</span> x;

x <span class="org-operator">:=</span> <span class="org-number">351</span>;

z <span class="org-operator">::</span> y <span class="org-operator">-</span> x;
</pre>
</div>

<p>
The following questions relate to the above example.
</p>

<ol class="org-ol">
<li>What is the name of the first variable declared?</li>

<li>How many variables are declared?</li>

<li>What is the value of variable 'y' when the program starts, and when the program finishes?</li>

<li>What is the initial value of 'z'?</li>

<li>What is the type of 'z'?</li>

<li>What is the value of the variable 'x' when the program starts, and when the program finishes?</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgb4bc2f9" class="outline-3">
<h3 id="orgb4bc2f9"><span class="section-number-3">2.4.</span> Basic Expressions</h3>
<div class="outline-text-3" id="text-2-4">
</div>
