documentation/glint/thebook.org
*** Arithmetic

Glint programs often need to do basic math; for this, there are the arithmetic operators. These include the standard addition (=+=), subtraction (=-= ), multiplication (=*=), division (=/=), and modulo (=%=).

*** Bitwise

On computers, data is represented as bits. Bitwise operations allow you to operate directly on the data bits, rather than on sets of bits with some applied semantics (i.e. an 8-bit signed byte). Bitwise operations include AND, OR, XOR, and NOT.

*** Implicit Casting

# What types of coercion are allowed.

In Glint, the philosophy is that you should have to write less code /when you can/. That means that, as long as everything is clear to the compiler, you don't need to mark up your program with meaning that is already implied. This reduces the code the Glint programmer has to write, and, in turn, reduces chances that they may introduce a bug.

An integer is implicitly convertible to a boolean, and vice versa.

For integer to integer casts, it is valid if the bitwidth we are casting from is less than or equal to the bitwidth we are casting to, OR, if the values are known at compile time, if data is preserved through performing the cast.

A struct is implicitly convertible to any supplanted member.

A fixed array is implicitly convertible to an array view.

A dynamic array is implicitly convertible to an array view.

Functions are implicitly convertible to their corresponding function pointers.

Functions with no parameters are implicitly convertible to their return type.

Pointers are convertible to =void.ptr=.

*** Explicit Casting

To treat a variable's memory as if it were of another type, you can explicitly cast a value. To do this, simply invoke the type with a single argument of the type you'd like to cast.

To cast integer =42= to =byte=:
#+begin_src glint
  byte 42;
#+end_src

*** Glint Exercise

TODO
# Gotcha test with explicit cast of a large value to a small type.

** Glint's Print

# How printing stuff works.

Often, a program will need to "print" values, such that a human running the program may see them. We still use the word "print", but we are not referring to printing onto paper; now-a-days, we have software terminals which are much faster and cheaper to run than a dedicated printer =:^)=.

In =Glint=, the =print= keyword acts as a pseudo-function, and inserts code for each argument passed to it according to the type of the argument.

- =void= arguments signal an error.
- =byte= arguments get printed immediately using =putchar= or similar.
- =[byte]=, =[byte view]=, and fixed byte arrays (i.e. =[byte 4]=) arguments get each byte printed using =putchar= or similar.
- Otherwise, a call to =format=, a function that returns a dynamic byte array, is inserted, the contents of that returned dynamic byte array are printed, and then the dynamic array is freed.

Since byte literals are of =byte= type, they get printed "verbatim". The following Glint program would print =420= and then a newline (line feed character).

#+begin_src glint
  print `4`, `2`, `0`, `\n`;
#+end_src

*** Glint Exercise

TODO
# "what is the output of the program?"
# "what would the output of the program be if 'x' was '3'?"

** Arrays

An array is a (contiguous) collection of a given element type.

A fixed array has the amount of elements known at compile-time. This is like arrays in the C language.

A dynamic array has the amount of elements known at runtime. This is like vectors in the C++ language.

An array view is a non-owning view of a contiguous collection of elements of a given type.

*** Fixed Arrays


A fixed array has the amount of elements known at compile-time. This means that the compiler is able to check every compile-time known subscript to be in range. You should use this type of array if the amount of elements never changes.

# Mention how these are what string literals are.
The type of a string literal is a fixed array with an element type of =byte=. The size of the fixed array is the amount of bytes needed to contain the contents of the string literal, plus one for the implicit terminating NUL byte.

# TODO: Fixed array interaction with ranged for loop expression

