docs/thebook.html
<div id="outline-container-org74d0904" class="outline-4">
<h4 id="org74d0904"><span class="section-number-4">2.4.1.</span> Arithmetic</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Glint programs often need to do basic math; for this, there are the arithmetic operators. These include the standard addition (<code>+</code>), subtraction (<code>-</code> ), multiplication (<code>*</code>), division (<code>/</code>), and modulo (<code>%</code>).
</p>
</div>
</div>
<div id="outline-container-org5a42846" class="outline-4">
<h4 id="org5a42846"><span class="section-number-4">2.4.2.</span> Bitwise</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
On computers, data is represented as bits. Bitwise operations allow you to operate directly on the data bits, rather than on sets of bits with some applied semantics (i.e. an 8-bit signed byte). Bitwise operations include AND, OR, XOR, and NOT.
</p>
</div>
</div>
<div id="outline-container-orgd7c7094" class="outline-4">
<h4 id="orgd7c7094"><span class="section-number-4">2.4.3.</span> Implicit Casting</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
In Glint, the philosophy is that you should have to write less code <i>when you can</i>. That means that, as long as everything is clear to the compiler, you don't need to mark up your program with meaning that is already implied. This reduces the code the Glint programmer has to write, and, in turn, reduces chances that they may introduce a bug.
</p>

<p>
An integer is implicitly convertible to a boolean, and vice versa.
</p>

<p>
For integer to integer casts, it is valid if the bitwidth we are casting from is less than or equal to the bitwidth we are casting to, OR, if the values are known at compile time, if data is preserved through performing the cast.
</p>

<p>
A struct is implicitly convertible to any supplanted member.
</p>

<p>
A fixed array is implicitly convertible to an array view.
</p>

<p>
A dynamic array is implicitly convertible to an array view.
</p>

<p>
Functions are implicitly convertible to their corresponding function pointers.
</p>

<p>
Functions with no parameters are implicitly convertible to their return type.
</p>

<p>
Pointers are convertible to <code>void.ptr</code>.
</p>
</div>
</div>
<div id="outline-container-orge4b301e" class="outline-4">
<h4 id="orge4b301e"><span class="section-number-4">2.4.4.</span> Explicit Casting</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
To treat a variable's memory as if it were of another type, you can explicitly cast a value. To do this, simply invoke the type with a single argument of the type you'd like to cast.
</p>

<p>
To cast integer <code>42</code> to <code>byte</code>:
</p>
<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">byte</span> <span class="org-number">42</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org340d117" class="outline-4">
<h4 id="org340d117"><span class="section-number-4">2.4.5.</span> Glint Exercise</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
TODO
</p>
</div>
</div>
</div>
<div id="outline-container-orgf96dd2c" class="outline-3">
<h3 id="orgf96dd2c"><span class="section-number-3">2.5.</span> Glint's Print</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Often, a program will need to "print" values, such that a human running the program may see them. We still use the word "print", but we are not referring to printing onto paper; now-a-days, we have software terminals which are much faster and cheaper to run than a dedicated printer <code>:^)</code>.
</p>

<p>
In <code>Glint</code>, the <code>print</code> keyword acts as a pseudo-function, and inserts code for each argument passed to it according to the type of the argument.
</p>

<ul class="org-ul">
<li><code>void</code> arguments signal an error.</li>
<li><code>byte</code> arguments get printed immediately using <code>putchar</code> or similar.</li>
<li><code>[byte]</code>, <code>[byte view]</code>, and fixed byte arrays (i.e. <code>[byte 4]</code>) arguments get each byte printed using <code>putchar</code> or similar.</li>
<li>Otherwise, a call to <code>format</code>, a function that returns a dynamic byte array, is inserted, the contents of that returned dynamic byte array are printed, and then the dynamic array is freed.</li>
</ul>

<p>
Since byte literals are of <code>byte</code> type, they get printed "verbatim". The following Glint program would print <code>420</code> and then a newline (line feed character).
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-keyword">print</span> <span class="org-number">`4`</span>, <span class="org-number">`2`</span>, <span class="org-number">`0`</span>, <span class="org-number">`\n`</span>;
</pre>
</div>
</div>
<div id="outline-container-org9a4d6d0" class="outline-4">
<h4 id="org9a4d6d0"><span class="section-number-4">2.5.1.</span> Glint Exercise</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
TODO
</p>
</div>
</div>
</div>
<div id="outline-container-org0f6d6f8" class="outline-3">
<h3 id="org0f6d6f8"><span class="section-number-3">2.6.</span> Arrays</h3>
<div class="outline-text-3" id="text-2-6">
<p>
An array is a (contiguous) collection of a given element type.
</p>

<p>
A fixed array has the amount of elements known at compile-time. This is like arrays in the C language.
</p>

<p>
A dynamic array has the amount of elements known at runtime. This is like vectors in the C++ language.
</p>

<p>
An array view is a non-owning view of a contiguous collection of elements of a given type.
</p>
</div>
<div id="outline-container-orgdd80297" class="outline-4">
<h4 id="orgdd80297"><span class="section-number-4">2.6.1.</span> Fixed Arrays</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
A fixed array has the amount of elements known at compile-time. This means that the compiler is able to check every compile-time known subscript to be in range. You should use this type of array if the amount of elements never changes.
</p>

<p>
The type of a string literal is a fixed array with an element type of <code>byte</code>. The size of the fixed array is the amount of bytes needed to contain the contents of the string literal, plus one for the implicit terminating NUL byte.
</p>
</div>
</div>
