docs/thebook.html
<div id="outline-container-org735c73a" class="outline-4">
<h4 id="org735c73a"><span class="section-number-4">2.6.2.</span> Dynamic Arrays</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
A dynamic array may have any amount of elements; any given instance of a dynamic array type stores a value regarding it's size.
</p>

<p>
A dynamic array's <code>data</code> pointer is initialized using the return value of <code>malloc</code> (A function provided by the C standard library). Glint is (mainly) intended to write userspace programs, and as such defaults to defining <code>main</code> (such that a C runtime may call it). Therefore, Glint implementations may rely on the presence of any C runtime functions (like <code>malloc</code>) to implement their features.
</p>

<p>
That's right! Dynamic arrays are <i>always</i> default initialized, and <code>data</code> <i>always</i> points to some memory of size <code>capacity * byte_size_of_element_type</code>.
</p>

<p>
Therefore, the elements of a dynamic array are available via a subscriptable pointer at the <code>data</code> member. The first element of dynamic array <code>d</code> is accessible via <code>@d.data[0]</code>; there is a short-hand that subscripting a dynamic array directly is equivalent to subscripting it's <code>data</code> member. That means the first element is usually accessed using <code>@d[0]</code>.
</p>

<p>
You can think of a dynamic array type as a shorthand for defining the following struct, where <code>T</code> is the element type of the dynamic array.
</p>
<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">[T]</span>;
<span class="org-comment">;; equivalent to</span>
<span class="org-type">struct</span> <span class="org-delimiter">{</span>
  data <span class="org-operator">:</span> <span class="org-type">T.ptr</span>;
  size <span class="org-operator">:</span> <span class="org-type">uint</span>;
  capacity <span class="org-operator">:</span> <span class="org-type">uint</span>;
<span class="org-delimiter">}</span>;
</pre>
</div>

<p>
Where <code>size</code> is the first invalid index at <code>data</code>. <code>capacity</code> refers to the size of memory located at <code>data</code>. If the memory at <code>data</code> is not large enough to store an inserted element, <code>data</code> is reallocated and all of the old elements are copied to the new memory.
</p>

<p>
An element may be prepended to (added to the front of) a dynamic array using the <code>~=</code> operator.
</p>
<div class="org-src-container">
<pre class="src src-glint">d <span class="org-operator">:</span> <span class="org-type">[byte]</span>;
d <span class="org-operator">~=</span> <span class="org-number">`9`</span>;
d <span class="org-operator">~=</span> <span class="org-number">`6`</span>;

<span class="org-comment">;; Outputs 69, then a newline</span>
<span class="org-keyword">print</span> d, <span class="org-number">`\n`</span>;
</pre>
</div>

<p>
An element may be appended to (added to the back of) a dynamic array using the <code>+=</code> operator.
</p>
<div class="org-src-container">
<pre class="src src-glint">d <span class="org-operator">:</span> <span class="org-type">[byte]</span>;
d <span class="org-operator">+=</span> <span class="org-number">`6`</span>;
d <span class="org-operator">+=</span> <span class="org-number">`9`</span>;

<span class="org-comment">;; Outputs 69, then a newline</span>
<span class="org-keyword">print</span> d, <span class="org-number">`\n`</span>;
</pre>
</div>

<p>
Finally, when a dynamic array is declared, memory is allocated; that means that, after the dynamic array is done being used, the programmer must free it by using the unary minus operator <code>-</code>.
</p>
<div class="org-src-container">
<pre class="src src-glint">d <span class="org-operator">:</span> <span class="org-type">[byte]</span>;
d <span class="org-operator">+=</span> <span class="org-number">`6`</span>;
d <span class="org-operator">+=</span> <span class="org-number">`9`</span>;

<span class="org-comment">;; Outputs 69, then a newline</span>
<span class="org-keyword">print</span> d, <span class="org-number">`\n`</span>;

<span class="org-comment">;; Free the memory associated with the dynamic array.</span>
<span class="org-operator">-</span>d;
<span class="org-comment">;; Any further uses of 'd' would be a program error reported by the</span>
<span class="org-comment">;; compiler.</span>
</pre>
</div>

<p>
A dynamic array is compatible with a ranged for loop expression (more on that later).
</p>
</div>
</div>
<div id="outline-container-orgae47181" class="outline-4">
<h4 id="orgae47181"><span class="section-number-4">2.6.3.</span> Array Views</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
You can think of a view type as a shorthand for defining the following struct, where <code>T</code> is the element type.
</p>
<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">[T view]</span>;
<span class="org-comment">;; equivalent to</span>
<span class="org-type">struct</span> <span class="org-delimiter">{</span>
  data <span class="org-operator">:</span> <span class="org-type">T.ptr</span>;
  size <span class="org-operator">:</span> <span class="org-type">uint</span>;
<span class="org-delimiter">}</span>;
</pre>
</div>

<p>
A view is meant to act as the minimal representation of a contiguous set of elements of a given type; it contains a pointer to the contiguous memory where all the elements are stored, as well as a value denoting how many elements are stored there.
</p>

<p>
A view is compatible with a ranged for loop expression (more on that later).
</p>
</div>
</div>
</div>
<div id="outline-container-org47ec9b4" class="outline-3">
<h3 id="org47ec9b4"><span class="section-number-3">2.7.</span> Conditionals and Control Flow</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-orge9105fb" class="outline-4">
<h4 id="orge9105fb"><span class="section-number-4">2.7.1.</span> <code>if</code></h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
<code>if</code> evaluates a condition expression, and, if the result is truthy, evaluates a body expression. Optionally, when an <code>else</code> clause is present, a different body expression will be evaluated if the result of evaluating the condition expression is falsy.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-keyword">if</span> condition, body;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-keyword">if</span> condition,
  then
<span class="org-keyword">else</span> otherwise;
</pre>
</div>
</div>
</div>
<div id="outline-container-org46629ab" class="outline-4">
<h4 id="org46629ab"><span class="section-number-4">2.7.2.</span> <code>while</code></h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
<code>while</code> evaluates a condition expression, and, if the result is truthy, evaluates a body expression. After evaluating the body expression, it will jump back to evaluating the condition expression.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-keyword">while</span> condition, body;
</pre>
</div>
</div>
</div>
