documentation/glint/thebook.txt

  A dynamic array may have any amount of elements; any given instance of
  a dynamic array type stores a value regarding it's size.

  A dynamic array's `data' pointer is initialized using the return value
  of `malloc' (A function provided by the C standard library). Glint is
  (mainly) intended to write userspace programs, and as such defaults to
  defining `main' (such that a C runtime may call it). Therefore, Glint
  implementations may rely on the presence of any C runtime functions
  (like `malloc') to implement their features.

  That's right! Dynamic arrays are /always/ default initialized, and
  `data' /always/ points to some memory of size `capacity *
  byte_size_of_element_type'.

  Therefore, the elements of a dynamic array are available via a
  subscriptable pointer at the `data' member. The first element of
  dynamic array `d' is accessible via `@d.data[0]'; there is a
  short-hand that subscripting a dynamic array directly is equivalent to
  subscripting it's `data' member. That means the first element is
  usually accessed using `@d[0]'.

  You can think of a dynamic array type as a shorthand for defining the
  following struct, where `T' is the element type of the dynamic array.
  ,----
  | [T];
  | ;; equivalent to
  | struct {
  |   data : T.ptr;
  |   size : uint;
  |   capacity : uint;
  | };
  `----

  Where `size' is the first invalid index at `data'. `capacity' refers
  to the size of memory located at `data'. If the memory at `data' is
  not large enough to store an inserted element, `data' is reallocated
  and all of the old elements are copied to the new memory.

  An element may be prepended to (added to the front of) a dynamic array
  using the `~=' operator.
  ,----
  | d : [byte];
  | d ~= `9`;
  | d ~= `6`;
  | 
  | ;; Outputs 69, then a newline
  | print d, `\n`;
  `----

  An element may be appended to (added to the back of) a dynamic array
  using the `+=' operator.
  ,----
  | d : [byte];
  | d += `6`;
  | d += `9`;
  | 
  | ;; Outputs 69, then a newline
  | print d, `\n`;
  `----

  Finally, when a dynamic array is declared, memory is allocated; that
  means that, after the dynamic array is done being used, the programmer
  must free it by using the unary minus operator `-'.
  ,----
  | d : [byte];
  | d += `6`;
  | d += `9`;
  | 
  | ;; Outputs 69, then a newline
  | print d, `\n`;
  | 
  | ;; Free the memory associated with the dynamic array.
  | -d;
  | ;; Any further uses of 'd' would be a program error reported by the
  | ;; compiler.
  `----

  A dynamic array is compatible with a ranged for loop expression (more
  on that later).


2.6.3 Array Views
-----------------

  You can think of a view type as a shorthand for defining the following
  struct, where `T' is the element type.
  ,----
  | [T view];
  | ;; equivalent to
  | struct {
  |   data : T.ptr;
  |   size : uint;
  | };
  `----

  A view is meant to act as the minimal representation of a contiguous
  set of elements of a given type; it contains a pointer to the
  contiguous memory where all the elements are stored, as well as a
  value denoting how many elements are stored there.

  A view is compatible with a ranged for loop expression (more on that
  later).


2.7 Conditionals and Control Flow
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

2.7.1 `if'
----------

  `if' evaluates a condition expression, and, if the result is truthy,
  evaluates a body expression. Optionally, when an `else' clause is
  present, a different body expression will be evaluated if the result
  of evaluating the condition expression is falsy.

  ,----
  | if condition, body;
  `----

  ,----
  | if condition,
  |   then
  | else otherwise;
  `----


2.7.2 `while'
-------------

  `while' evaluates a condition expression, and, if the result is
  truthy, evaluates a body expression. After evaluating the body
  expression, it will jump back to evaluating the condition expression.

  ,----
  | while condition, body;
  `----


2.7.3 `for'
-----------
