documentation/glint/thebook.org
*** =for=

=for= is a loop structure that will iterate over anything with =data= and =size= members (like dynamic arrays or array views). It provides a reference to the corresponding element for each iteration.

#+begin_src glint
  for element in container, body;
#+end_src

*** =cfor=

=cfor= is a control structure that mimics C's =for=.

#+begin_src glint
  cfor init; condition; increment; body;
#+end_src

*** =match=

=match= selects a control flow depending on which member of a sum type is held.

=match= must handle every possible member a sum type may have.

#+begin_src glint
  match value_of_sum_type, {
    .member0 expr;
    .member1 expr;
  };
#+end_src

** Declared Types

# structs, unions, enums, and sums.

# TODO
# Using compound initializer

# TODO
# named expressions in compound literal for out-of-member-order struct
# value assignment.

*** Structs

The most important declared type there is, the =struct=. A struct is a way to group other types together in memory, and reference each type's value by a name.

#+begin_src glint
  struct {
    x : int;
    y : uint;
  };
#+end_src

Given an instance of the above struct, setting the value of =x= would *not* alter the value of =y=, and vice versa. They are unique, named points in memory.

To access these points, you use the member access operator, =.=, with the object you are trying to access on the left hand side, and the name of the member you are trying to reference on the right hand side. A member access, as it references a unique point in memory, may be assigned to.

#+begin_src glint
  A :: struct {
    x : int;
    y : int;
  };

  foo : A;

  foo.x := 70;
  foo.y := -1;

  foo.x + foo.y;
#+end_src

**** Supplanted Members

A struct may have another struct (or sum) type supplanted within it; this means that the supplanted type's members are now accessible as if they were members of the struct the member resides in. In reality, the compiler does generate a unique name for the member and generates code to access that member by name; this construct is simply for the programmer's convenience.

#+begin_src glint
  A :: struct {
    x : int;
    y : int;
  };

  B :: struct {
    supplant A;
    z : int;
  };

  foo : B;
  foo.x;
  foo.y;
  foo.z;
#+end_src

*** Unions

A union is a way to store multiple types in one place in memory. A union is only as big as it's largest member.

#+begin_src glint
  union {
    x : int;
    y : uint;
  };
#+end_src

Given an instance of the above struct, *setting the value of =x= would alter the value of =y=*, and vice versa. They /are/ named points in memory, but they are not unique. You could say a union gives multiple names to the same position in memory.

If you can't picture why that'd be useful, then you don't ever need to use unions; they are really just there so that people who want to solve problems a certain way are able to do it that way.

*** Enumerations

Enumerations, often shortened to just /enums/, are named constant values.

Let's say you wanted the number =1= to be called =Success=, and the number =7= to be called =Erased=, to make your Glint code more readable, or understandable.
#+begin_src glint
  Code :: enum(int) {
    Success :: 1;
    Erased :: 7;
  };

  Code.Success; ;; = 1
  Code.Erased; ;; = 7
#+end_src

Enumerators (in Glint) are /just named constants/. As such, the values of an enumerator must be known at compile time. The underlying value type may be specified within parentheses.

If you come from Rust (you crustacean, you), see sum types for what you may call enums. If you come from C or C++, not too much has changed.

