docs/thebook.html
<div id="outline-container-org12abff1" class="outline-4">
<h4 id="org12abff1"><span class="section-number-4">2.7.3.</span> <code>for</code></h4>
<div class="outline-text-4" id="text-2-7-3">
<p>
<code>for</code> is a loop structure that will iterate over anything with <code>data</code> and <code>size</code> members (like dynamic arrays or array views). It provides a reference to the corresponding element for each iteration.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-keyword">for</span> element <span class="org-keyword">in</span> container, body;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc6e44be" class="outline-4">
<h4 id="orgc6e44be"><span class="section-number-4">2.7.4.</span> <code>cfor</code></h4>
<div class="outline-text-4" id="text-2-7-4">
<p>
<code>cfor</code> is a control structure that mimics C's <code>for</code>.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-keyword">cfor</span> init; condition; increment; body;
</pre>
</div>
</div>
</div>
<div id="outline-container-org480b54a" class="outline-4">
<h4 id="org480b54a"><span class="section-number-4">2.7.5.</span> <code>match</code></h4>
<div class="outline-text-4" id="text-2-7-5">
<p>
<code>match</code> selects a control flow depending on which member of a sum type is held.
</p>

<p>
<code>match</code> must handle every possible member a sum type may have.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-keyword">match</span> value_of_sum_type, <span class="org-delimiter">{</span>
  .member0 expr;
  .member1 expr;
<span class="org-delimiter">}</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbd77233" class="outline-3">
<h3 id="orgbd77233"><span class="section-number-3">2.8.</span> Declared Types</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-org837b97a" class="outline-4">
<h4 id="org837b97a"><span class="section-number-4">2.8.1.</span> Structs</h4>
<div class="outline-text-4" id="text-2-8-1">
<p>
The most important declared type there is, the <code>struct</code>. A struct is a way to group other types together in memory, and reference each type's value by a name.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">struct</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">uint</span>;
<span class="org-delimiter">}</span>;
</pre>
</div>

<p>
Given an instance of the above struct, setting the value of <code>x</code> would <b>not</b> alter the value of <code>y</code>, and vice versa. They are unique, named points in memory.
</p>

<p>
To access these points, you use the member access operator, <code>.</code>, with the object you are trying to access on the left hand side, and the name of the member you are trying to reference on the right hand side. A member access, as it references a unique point in memory, may be assigned to.
</p>

<div class="org-src-container">
<pre class="src src-glint">A <span class="org-operator">:</span> <span class="org-type">struct</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">int</span>;
<span class="org-delimiter">}</span>;

foo <span class="org-operator">:</span> <span class="org-type">A</span>;

foo.x <span class="org-operator">:=</span> <span class="org-number">70</span>;
foo.y <span class="org-operator">:=</span> <span class="org-operator">-</span><span class="org-number">1</span>;

foo.x <span class="org-operator">+</span> foo.y;
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org1de3d25"></a>Supplanted Members<br />
<div class="outline-text-5" id="text-2-8-1-1">
<p>
A struct may have another struct (or sum) type supplanted within it; this means that the supplanted type's members are now accessible as if they were members of the struct the member resides in. In reality, the compiler does generate a unique name for the member and generates code to access that member by name; this construct is simply for the programmer's convenience.
</p>

<div class="org-src-container">
<pre class="src src-glint">A <span class="org-operator">:</span> <span class="org-type">struct</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">int</span>;
<span class="org-delimiter">}</span>;

B <span class="org-operator">:</span> <span class="org-type">struct</span> <span class="org-delimiter">{</span>
  <span class="org-keyword">supplant</span> A;
  z <span class="org-operator">:</span> <span class="org-type">int</span>;
<span class="org-delimiter">}</span>;

foo <span class="org-operator">:</span> <span class="org-type">B</span>;
foo.x;
foo.y;
foo.z;
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org2dd7037" class="outline-4">
<h4 id="org2dd7037"><span class="section-number-4">2.8.2.</span> Unions</h4>
<div class="outline-text-4" id="text-2-8-2">
<p>
A union is a way to store multiple types in one place in memory. A union is only as big as it's largest member.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">union</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">uint</span>;
<span class="org-delimiter">}</span>;
</pre>
</div>

<p>
Given an instance of the above struct, <b>setting the value of <code>x</code> would alter the value of <code>y</code></b>, and vice versa. They <i>are</i> named points in memory, but they are not unique. You could say a union gives multiple names to the same position in memory.
</p>

<p>
If you can't picture why that'd be useful, then you don't ever need to use unions; they are really just there so that people who want to solve problems a certain way are able to do it that way.
</p>
</div>
</div>
<div id="outline-container-orgc6863f5" class="outline-4">
<h4 id="orgc6863f5"><span class="section-number-4">2.8.3.</span> Enumerations</h4>
<div class="outline-text-4" id="text-2-8-3">
<p>
Enumerations, often shortened to just <i>enums</i>, are named constant values.
</p>

<p>
Let's say you wanted the number <code>1</code> to be called <code>Success</code>, and the number <code>7</code> to be called <code>Erased</code>, to make your Glint code more readable, or understandable.
</p>
<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">enum</span><span class="org-delimiter">(</span><span class="org-type">int</span><span class="org-delimiter">)</span> <span class="org-delimiter">{</span>
  Success <span class="org-operator">::</span> <span class="org-number">1</span>;
  Erased <span class="org-operator">::</span> <span class="org-number">7</span>;
<span class="org-delimiter">}</span>;
</pre>
</div>

<p>
Enumerators (in Glint) are <i>just named constants</i>. If you come from Rust (you crustacean, you), see sum types for what you may call enums. If you come from C or C++, not too much has changed.
</p>
</div>
</div>
