docs/thebook.html
<div id="outline-container-org92ba4ee" class="outline-4">
<h4 id="org92ba4ee"><span class="section-number-4">2.8.4.</span> Sums</h4>
<div class="outline-text-4" id="text-2-8-4">
<p>
A sum is a way to store <b>one of</b> a group of types in one position.
</p>

<p>
A sum type is a lot like a union, except that when you access a member of a sum type, it is verified that the member you are accessing is <i>actually</i> currently stored in the memory where that member is stored. You see, each member of a sum type is stored at the same position in memory (like a union), but the sum type also keeps track of what member was last assigned to, and, as such, what kind of value is stored in it's member memory.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">sum</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">int</span>;
  z <span class="org-operator">:</span> <span class="org-type">byte</span>;
<span class="org-delimiter">}</span>;
</pre>
</div>

<p>
Given an instance of the above struct, <b>setting the value of <code>x</code> would alter the value of</b> <code>y</code>, and vice versa. The catch is that, you would never be able to access <code>y</code> after setting <code>x</code>; doing so would actually cause the program to exit.
</p>

<div class="org-src-container">
<pre class="src src-glint">A <span class="org-operator">:</span> <span class="org-type">sum</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">byte</span>;
<span class="org-delimiter">}</span>;

foo <span class="org-operator">:</span> <span class="org-type">A</span>;
foo.x; <span class="org-comment">;; program exits here</span>
</pre>
</div>

<p>
The only way to get your Glint program to continue execution when accessing a sum's member is to access the <i>right</i> one. The <i>right</i> one is whichever one is currently stored in the sum type. Note that this is NOT calculated at compile-time; each sum type stores a value in the computer's memory <i>at run-time</i> indicating which member is valid (if any). The compiler automatically generates code to update this value accordingly whenever assigning to any sum type's member.
</p>

<div class="org-src-container">
<pre class="src src-glint">A <span class="org-operator">:</span> <span class="org-type">sum</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">byte</span>;
<span class="org-delimiter">}</span>;

foo <span class="org-operator">:</span> <span class="org-type">A</span>;
foo.x <span class="org-operator">:=</span> <span class="org-number">69</span>;
foo.y; <span class="org-comment">;; program exits here</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-glint">A <span class="org-operator">:</span> <span class="org-type">sum</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">byte</span>;
<span class="org-delimiter">}</span>;

foo <span class="org-operator">:</span> <span class="org-type">A</span>;
foo.x <span class="org-operator">:=</span> <span class="org-number">69</span>;
foo.y <span class="org-operator">:=</span> foo.x;
foo.y;
foo.x; <span class="org-comment">;; program exits here</span>
</pre>
</div>

<p>
The members of a given instance of a sum type may not co-exist at any one time. However, over the "lifetime" of an instance of a sum type, any amount of members may be valid.
</p>

<p>
You may query if a given member is valid using the <code>has</code> unary prefix operator.
</p>

<div class="org-src-container">
<pre class="src src-glint">A <span class="org-operator">:</span> <span class="org-type">sum</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">byte</span>;
<span class="org-delimiter">}</span>;

foo <span class="org-operator">:</span> <span class="org-type">A</span>;
foo.x <span class="org-operator">:=</span> <span class="org-number">69</span>;
foo.y <span class="org-operator">:=</span> foo.x;

out <span class="org-operator">:</span> <span class="org-type">int</span>;

<span class="org-keyword">if</span> <span class="org-delimiter">(</span>has foo.x<span class="org-delimiter">)</span>, out <span class="org-operator">:=</span> foo.x;
<span class="org-keyword">if</span> <span class="org-delimiter">(</span>has foo.y<span class="org-delimiter">)</span>, out <span class="org-operator">:=</span> foo.y;

out;
</pre>
</div>

<p>
To avoid long chains of <code>if</code> expressions used in conjunction with <code>has</code>, as seen above, the <code>match</code> expression may be used in turn. In fact, there are more benefits to using <code>match</code>, such as compile-time guarantee that every possible member has a control flow to handle it.
</p>

<div class="org-src-container">
<pre class="src src-glint">A <span class="org-operator">:</span> <span class="org-type">sum</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">byte</span>;
<span class="org-delimiter">}</span>;

foo <span class="org-operator">:</span> <span class="org-type">A</span>;
foo.x <span class="org-operator">:=</span> <span class="org-number">69</span>;
foo.y <span class="org-operator">:=</span> foo.x;

<span class="org-keyword">match</span> foo, <span class="org-delimiter">{</span>
  .x out <span class="org-operator">:=</span> foo.x;
  .y out <span class="org-operator">:=</span> foo.y;
<span class="org-delimiter">}</span>;
</pre>
</div>

<p>
The match expression will execute exactly one of it's named body expressions: the one matching the name of the value currently stored in the instance of the given sum type.
</p>

<p>
The program would not compile if there were no body expression named <code>x</code> or if there were no body expression named <code>y</code>; every declared member within the sum type must have an expression associated with it in a <code>match</code> expression on that sum type.
</p>
</div>
</div>
</div>
