documentation/glint/thebook.txt

  A sum is a way to store *one of* a group of types in one position.

  A sum type is a lot like a union, except that when you access a member
  of a sum type, it is verified that the member you are accessing is
  /actually/ currently stored in the memory where that member is
  stored. You see, each member of a sum type is stored at the same
  position in memory (like a union), but the sum type also keeps track
  of what member was last assigned to, and, as such, what kind of value
  is stored in it's member memory.

  ,----
  | sum {
  |   x : int;
  |   y : int;
  |   z : byte;
  | };
  `----

  Given an instance of the above struct, *setting the value of `x' would
  alter the value of* `y', and vice versa. The catch is that, you would
  never be able to access `y' after setting `x'; doing so would actually
  cause the program to exit.

  ,----
  | A :: sum {
  |   x : int;
  |   y : byte;
  | };
  | 
  | foo : A;
  | foo.x; ;; program exits here
  `----

  The only way to get your Glint program to continue execution when
  accessing a sum's member is to access the /right/ one. The /right/ one
  is whichever one is currently stored in the sum type. Note that this
  is NOT calculated at compile-time; each sum type stores a value in the
  computer's memory /at run-time/ indicating which member is valid (if
  any). The compiler automatically generates code to update this value
  accordingly whenever assigning to any sum type's member.

  ,----
  | A :: sum {
  |   x : int;
  |   y : byte;
  | };
  | 
  | foo : A;
  | foo.x := 69;
  | foo.y; ;; program exits here
  `----

  ,----
  | A :: sum {
  |   x : int;
  |   y : byte;
  | };
  | 
  | foo : A;
  | foo.x := 69;
  | foo.y := foo.x;
  | foo.y;
  | foo.x; ;; program exits here
  `----

  The members of a given instance of a sum type may not co-exist at any
  one time. However, over the "lifetime" of an instance of a sum type,
  any amount of members may be valid.

  You may query if a given member is valid using the `has' unary prefix
  operator.

  ,----
  | A :: sum {
  |   x : int;
  |   y : byte;
  | };
  | 
  | foo : A;
  | foo.x := 69;
  | foo.y := foo.x;
  | 
  | out : int;
  | 
  | if (has foo.x), out := foo.x;
  | if (has foo.y), out := foo.y;
  | 
  | out;
  `----

  To avoid long chains of `if' expressions used in conjunction with
  `has', as seen above, the `match' expression may be used in turn. In
  fact, there are more benefits to using `match', such as compile-time
  guarantee that every possible member has a control flow to handle it.

  ,----
  | A :: sum {
  |   x : int;
  |   y : byte;
  | };
  | 
  | foo : A;
  | foo.x := 69;
  | foo.y := foo.x;
  | 
  | match foo, {
  |   .x out := foo.x;
  |   .y out := foo.y;
  | };
  `----

  The match expression will execute exactly one of it's named body
  expressions: the one matching the name of the value currently stored
  in the instance of the given sum type.

  The program would not compile if there were no body expression named
  `x' or if there were no body expression named `y'; every declared
  member within the sum type must have an expression associated with it
  in a `match' expression on that sum type.
