docs/thebook.html
<div id="outline-container-org5d5cb6a" class="outline-3">
<h3 id="org5d5cb6a"><span class="section-number-3">2.9.</span> Basic Functions</h3>
<div class="outline-text-3" id="text-2-9">
<p>
A <i>function</i> is a concept that programming borrows from mathematics.
</p>

<p>
Remember \( f(x) \) in math class? That is a <i>function application</i>. What it means is that, <code>f</code> is some operation (or sequence of operations) that we would like to apply to <code>x</code>. Hence, <i>application</i>.
</p>

<p>
In programming, we've extended math to suit our use-case; variables have types associated with them, for example (not really a thing in math: numbers are numbers).
</p>

<p>
Functions are no different; programming extends them to better fit the common use-cases.
</p>

<p>
Just like in math, Glint functions may have any amount of parameters.
</p>

<p>
Remember <code>f(x)</code> from before? <code>x</code> is a <i>function parameter</i>. <code>f</code> is said to be a function with a single parameter. A parameter is a variable (as in, it may vary) value that may change upon different invocations of the function. You may think of it like a name for a placeholder value that will be filled in at some later point.
</p>

<dl class="org-dl">
<dt>On Parameters vs Arguments</dt><dd>Parameters appear in the function declaration and definition, while arguments appear in each function invocation. An argument is the value that a parameter takes on during a particular invocation of a function.</dd>
</dl>

<p>
NOTE: Function arguments are evaluated "in order"; that is, the order they appear <i>in the function's type declaration</i>.
</p>

<p>
Functions do not <i>just</i> execute an operation, or sequence of operations, though. They apply operations in order to form a result value, which is then said to be "returned from" the function, upon application. In Glint, the result of evaluating the last expression in a function is the return value, unless otherwise explicitly returning via <code>return</code>.
</p>

<p>
A function's return value is constrained to be of the declared return type of the function (such that uses of the function may rely upon a binary format of the returned value).
</p>

<p>
NOTE: There is a special built-in type named <code>void</code> which declares the absence of a valid binary value. Therefore, it is an incomplete type and uses of it are invalid. However, it is most used as the return type of a function that doesn't return anything; that way, the compiler knows not to expect a value to return, and you don't have to return an <code>int</code> for no reason or something (making future users of your module question why in the world you are returning zero from a function every time).
</p>

<p>
Basic functions allow the programmer to de-duplicate code, increase readability, and form custom control flow.
</p>

<p>
You should write a function when you find yourself writing the same set of expressions over and over, with just a few values swapped out for another in each set. Instead, extract that set of expressions into a function body, then invoke that function each time you need to do that set of operations.
</p>

<p>
Basic function example:
</p>
<div class="org-src-container">
<pre class="src src-glint">foo <span class="org-operator">:</span> <span class="org-type">[int 2]</span> <span class="org-operator">!</span><span class="org-delimiter">{</span> <span class="org-number">69</span>, <span class="org-number">42</span> <span class="org-delimiter">}</span>;
bar <span class="org-operator">:</span> <span class="org-type">[int 2]</span> <span class="org-operator">!</span><span class="org-delimiter">{</span> <span class="org-number">27</span>, <span class="org-number">42</span> <span class="org-delimiter">}</span>;
baz <span class="org-operator">:</span> <span class="org-type">[int 2]</span> <span class="org-operator">!</span><span class="org-delimiter">{</span> <span class="org-number">64920</span>, <span class="org-number">42</span> <span class="org-delimiter">}</span>;

<span class="org-operator">@</span>foo[<span class="org-number">1</span>] <span class="org-operator">*=</span> <span class="org-number">10</span>;
<span class="org-operator">@</span>bar[<span class="org-number">1</span>] <span class="org-operator">*=</span> <span class="org-number">10</span>;
<span class="org-operator">@</span>baz[<span class="org-number">1</span>] <span class="org-operator">*=</span> <span class="org-number">10</span>;
</pre>
</div>

<p>
With a function:
</p>
<div class="org-src-container">
<pre class="src src-glint">foo <span class="org-operator">:</span> <span class="org-type">[int 2]</span> <span class="org-operator">!</span><span class="org-delimiter">{</span> <span class="org-number">69</span>, <span class="org-number">42</span> <span class="org-delimiter">}</span>;
bar <span class="org-operator">:</span> <span class="org-type">[int 2]</span> <span class="org-operator">!</span><span class="org-delimiter">{</span> <span class="org-number">27</span>, <span class="org-number">42</span> <span class="org-delimiter">}</span>;
baz <span class="org-operator">:</span> <span class="org-type">[int 2]</span> <span class="org-operator">!</span><span class="org-delimiter">{</span> <span class="org-number">64920</span>, <span class="org-number">42</span> <span class="org-delimiter">}</span>;

<span class="org-function-name">ten_times_second</span> <span class="org-operator">:</span> <span class="org-type">void</span><span class="org-delimiter">(</span>x <span class="org-operator">:</span> <span class="org-type">[int 2]</span><span class="org-delimiter">)</span>
  <span class="org-operator">@</span>x[<span class="org-number">1</span>] <span class="org-operator">*=</span> <span class="org-number">10</span>;

ten_times_second foo;
ten_times_second bar;
ten_times_second baz;
</pre>
</div>

<p>
As you can see, when proper names are picked, functions increase the ability for code readers to understand what the code is trying to do (vs what it may actually be doing). They also allow for easier refactors; imagine you want to also multiply the first value of every array by 3. That would be one expression, one extra line of Glint code to write in the function body. Without a function, you'd have to write and edit that line of code where every invocation is! For this simple example, it would be doable, but, with a large and growing codebase, that becomes more and more difficult.
</p>
</div>
<div id="outline-container-orgd31d814" class="outline-4">
<h4 id="orgd31d814"><span class="section-number-4">2.9.1.</span> Function Attributes</h4>
</div>
</div>
