documentation/glint/thebook.txt


2.9 Basic Functions
~~~~~~~~~~~~~~~~~~~

  A /function/ is a concept that programming borrows from mathematics.

  Remember \( f(x) \) in math class? That is a /function
  application/. What it means is that, `f' is some operation (or
  sequence of operations) that we would like to apply to `x'. Hence,
  /application/.

  In programming, we've extended math to suit our use-case; variables
  have types associated with them, for example (not really a thing in
  math: numbers are numbers).

  Functions are no different; programming extends them to better fit the
  common use-cases.

  Just like in math, Glint functions may have any amount of parameters.

  Remember `f(x)' from before? `x' is a /function parameter/. `f' is
  said to be a function with a single parameter. A parameter is a
  variable (as in, it may vary) value that may change upon different
  invocations of the function. You may think of it like a name for a
  placeholder value that will be filled in at some later point.

  On Parameters vs Arguments
        Parameters appear in the function declaration and definition,
        while arguments appear in each function invocation. An argument
        is the value that a parameter takes on during a particular
        invocation of a function.

  NOTE: Function arguments are evaluated "in order"; that is, the order
  they appear /in the function's type declaration/.

  Functions do not /just/ execute an operation, or sequence of
  operations, though. They apply operations in order to form a result
  value, which is then said to be "returned from" the function, upon
  application. In Glint, the result of evaluating the last expression in
  a function is the return value, unless otherwise explicitly returning
  via `return'.

  A function's return value is constrained to be of the declared return
  type of the function (such that uses of the function may rely upon a
  binary format of the returned value).

  NOTE: There is a special built-in type named `void' which declares the
  absence of a valid binary value. Therefore, it is an incomplete type
  and uses of it are invalid. However, it is most used as the return
  type of a function that doesn't return anything; that way, the
  compiler knows not to expect a value to return, and you don't have to
  return an `int' for no reason or something (making future users of
  your module question why in the world you are returning zero from a
  function every time).

  Basic functions allow the programmer to de-duplicate code, increase
  readability, and form custom control flow.

  You should write a function when you find yourself writing the same
  set of expressions over and over, with just a few values swapped out
  for another in each set. Instead, extract that set of expressions into
  a function body, then invoke that function each time you need to do
  that set of operations.

  Basic function example:
  ,----
  | foo : [int 2] !{ 69, 42 };
  | bar : [int 2] !{ 27, 42 };
  | baz : [int 2] !{ 64920, 42 };
  | 
  | @foo[1] *= 10;
  | @bar[1] *= 10;
  | @baz[1] *= 10;
  `----

  With a function:
  ,----
  | foo : [int 2] !{ 69, 42 };
  | bar : [int 2] !{ 27, 42 };
  | baz : [int 2] !{ 64920, 42 };
  | 
  | ten_times_second : void(x : [int 2])
  |   @x[1] *= 10;
  | 
  | ten_times_second foo;
  | ten_times_second bar;
  | ten_times_second baz;
  `----

  As you can see, when proper names are picked, functions increase the
  ability for code readers to understand what the code is trying to do
  (vs what it may actually be doing). They also allow for easier
  refactors; imagine you want to also multiply the first value of every
  array by 3. That would be one expression, one extra line of Glint code
  to write in the function body. Without a function, you'd have to write
  and edit that line of code where every invocation is! For this simple
  example, it would be doable, but, with a large and growing codebase,
  that becomes more and more difficult.


2.9.1 Function Attributes
-------------------------
