docs/thebook.html
<div id="outline-container-orgdee2e20" class="outline-3">
<h3 id="orgdee2e20"><span class="section-number-3">2.10.</span> Pointers and References</h3>
<div class="outline-text-3" id="text-2-10">
<p>
We've talked a little about how variables (for the most part) are named locations in the computer's memory. When we say memory, we mean it's RAM (<i>Random Access Memory</i>). RAM is (usually) a linear set of addressable bytes that the CPU may read from and write to.
</p>

<p>
When we say <i>addressable</i>, we mean that there is a unique way of referring to each and every byte within that linear set. Mostly, this is done simply by index, and we call this index a <i>memory address</i>.
</p>

<p>
A <i>pointer</i> is simply a memory address; an index into that linear set of bytes that the CPU can do whatever it wants with. In Glint, pointers have an associated underlying type; the type tells Glint how to interpret the value in memory at that memory address. So, a value of type <code>int.ptr</code> (a pointer to an integer) will be some index into the linear memory array; we don't really care what it is. If we were to <code>load</code> the value at that memory address (technically the next eight values, since an <code>int</code> is eight bytes), we would then have a value of type <code>int</code>.
</p>

<p>
In Glint, subscripting is the act of offsetting a pointer by some multiple of the size of a given type. So, to continue with our last example, subscripting a value of type <code>int.ptr</code> by one would increase the value by eight, since that is the size in bytes of an integer. The idea is, the first subscript of a pointer gets the address where the next element in contiguous memory would be, if there were one. This applies to every value, not just the first, so the zero-eth subscript leaves the pointer unchanged, while the second subscript increases the pointer by the size of two elements (sixteen bytes in the case of <code>int.ptr</code>).
</p>

<p>
Do keep in mind that, unlike most other languages, Glint's subscript does <b>NOT</b> dereference. That is, the act of subscripting does not load any values in Glint; it simply calculates the memory address. In order to load a value from a memory address, you have to dereference it. In Glint, that is done via the unary prefix operator <code>@</code> (i.e. get the value "at" the given memory address).
</p>
</div>
</div>
<div id="outline-container-orgebaaf0d" class="outline-3">
<h3 id="orgebaaf0d"><span class="section-number-3">2.11.</span> Templates</h3>
<div class="outline-text-3" id="text-2-11">
<p>
Templates, at their core, are expressions which evaluate to other expressions.
</p>

<p>
A template is a special form of expression that results in an expression upon evaluation. You can think of it as code that generates code.
</p>

<p>
This is often useful when you have some expression (or set of expressions) that end up being duplicated throughout a function, with just a few values swapped out for different ones here and there.
</p>

<p>
First, let's look at the most basic template expression: the <i>identity</i> template.
</p>

<div class="org-src-container">
<pre class="src src-glint">template<span class="org-delimiter">(</span>x <span class="org-operator">:</span> expr<span class="org-delimiter">)</span> x;
</pre>
</div>

<p>
This template expression, when invoked with an expression, would evaluate to that argument expression unchanged.
</p>

<p>
Often, you want to use a template more than once; for convenience, a Glint programmer may name a template expression. This may also improve readability. Remember that templates are NOT functions! They are their own type of invocable (callable) expression.
</p>

<div class="org-src-container">
<pre class="src src-glint">identity <span class="org-operator">::</span> template<span class="org-delimiter">(</span>x <span class="org-operator">:</span> expr<span class="org-delimiter">)</span> x;

<span class="org-comment">;; Evaluates to '69420'.</span>
identity <span class="org-number">69420</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org2aa135f" class="outline-3">
<h3 id="org2aa135f"><span class="section-number-3">2.12.</span> Function Overloading</h3>
<div class="outline-text-3" id="text-2-12">
<p>
Glint supports <i>function overloading</i>, which is the idea of giving multiple definitions to a single, named function; each definition differs in their signature (return type and/or parameter types), and the compiler determines which definition to call at each call site based on the types of the argument expressions.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-comment">;; [0]</span>
<span class="org-function-name">make_byte</span> <span class="org-operator">:</span> <span class="org-type">byte</span><span class="org-delimiter">(</span>v <span class="org-operator">:</span> <span class="org-type">int</span><span class="org-delimiter">)</span>
  <span class="org-type">byte</span> v;

<span class="org-comment">;; [1]</span>
<span class="org-function-name">make_byte</span> <span class="org-operator">:</span> <span class="org-type">byte</span><span class="org-delimiter">(</span>v <span class="org-operator">:</span> <span class="org-type">byte</span><span class="org-delimiter">)</span>
  v;

make_byte <span class="org-number">69</span>; <span class="org-comment">;; calls [0]</span>
make_byte <span class="org-number">`0`</span>; <span class="org-comment">;; calls [1]</span>
</pre>
</div>
</div>
</div>
