documentation/glint/thebook.txt


2.10 Pointers and References
~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  We've talked a little about how variables (for the most part) are
  named locations in the computer's memory. When we say memory, we mean
  it's RAM (/Random Access Memory/). RAM is (usually) a linear set of
  addressable bytes that the CPU may read from and write to.

  When we say /addressable/, we mean that there is a unique way of
  referring to each and every byte within that linear set. Mostly, this
  is done simply by index, and we call this index a /memory address/.

  A /pointer/ is simply a memory address; an index into that linear set
  of bytes that the CPU can do whatever it wants with. In Glint,
  pointers have an associated underlying type; the type tells Glint how
  to interpret the value in memory at that memory address. So, a value
  of type `int.ptr' (a pointer to an integer) will be some index into
  the linear memory array; we don't really care what it is. If we were
  to `load' the value at that memory address (technically the next eight
  values, since an `int' is eight bytes), we would then have a value of
  type `int'.

  In Glint, subscripting is the act of offsetting a pointer by some
  multiple of the size of a given type. So, to continue with our last
  example, subscripting a value of type `int.ptr' by one would increase
  the value by eight, since that is the size in bytes of an integer. The
  idea is, the first subscript of a pointer gets the address where the
  next element in contiguous memory would be, if there were one. This
  applies to every value, not just the first, so the zero-eth subscript
  leaves the pointer unchanged, while the second subscript increases the
  pointer by the size of two elements (sixteen bytes in the case of
  `int.ptr').

  Do keep in mind that, unlike most other languages, Glint's subscript
  does *NOT* dereference. That is, the act of subscripting does not load
  any values in Glint; it simply calculates the memory address. In order
  to load a value from a memory address, you have to dereference it. In
  Glint, that is done via the unary prefix operator `@' (i.e. get the
  value "at" the given memory address).


2.11 Templates
~~~~~~~~~~~~~~

  Templates, at their core, are expressions which evaluate to other
  expressions.

  A template is a special form of expression that results in an
  expression upon evaluation. You can think of it as code that generates
  code.

  This is often useful when you have some expression (or set of
  expressions) that end up being duplicated throughout a function, with
  just a few values swapped out for different ones here and there.

  First, let's look at the most basic template expression: the
  /identity/ template.

  ,----
  | template(x : expr) x;
  `----

  This template expression, when invoked with an expression, would
  evaluate to that argument expression unchanged.

  Often, you want to use a template more than once; for convenience, a
  Glint programmer may name a template expression. This may also improve
  readability. Remember that templates are NOT functions! They are their
  own type of invocable (callable) expression.

  ,----
  | identity :: template(x : expr) x;
  | 
  | ;; Evaluates to '69420'.
  | identity 69420;
  `----


2.12 Function Overloading
~~~~~~~~~~~~~~~~~~~~~~~~~

  Glint supports /function overloading/, which is the idea of giving
  multiple definitions to a single, named function; each definition
  differs in their signature (return type and/or parameter types), and
  the compiler determines which definition to call at each call site
  based on the types of the argument expressions.

  ,----
  | ;; [0]
  | make_byte : byte(v : int)
  |   byte v;
  | 
  | ;; [1]
  | make_byte : byte(v : byte)
  |   v;
  | 
  | make_byte 69; ;; calls [0]
  | make_byte `0`; ;; calls [1]
  `----
