docs/thebook.html
<div id="outline-container-orgfdc04da" class="outline-3">
<h3 id="orgfdc04da"><span class="section-number-3">2.13.</span> Operator Overloading</h3>
<div class="outline-text-3" id="text-2-13">
<p>
<i>Operators</i> are tokens, or sequences of tokens, that may be placed somewhere around an expression in order to alter the result of the expression in some way. Operators may be defined by how many inputs they operate on (<i>arity</i>), as well as where the operator is placed in relation to the inputs (prefix, infix, or postfix). An operator that comes before the single expression it operates on would be a <i>unary prefix operator</i>. An operator that sits between the two expressions it operates on would be a <i>binary infix operator</i>.
</p>

<p>
For simple types like pointers or integers, an operator will map quite neatly to one (or a minimal amount of) machine instruction(s), so there is really no advantage to defining functions for these operations; instead, we insert the instructions directly.
</p>

<p>
However, in Glint, a programmer may declare their own types, as well as variables with values of those declared types. The programmer may want to take advantage of these operators for their own types; to accomplish this, Glint inserts calls to specially-named functions when these custom types are used in these operators that normally wouldn't support them. The programmer may then define these functions themselves, customizing the code that runs when these operators are used.
</p>

<p>
TODO: syntax example
</p>
</div>
</div>
<div id="outline-container-org55d4405" class="outline-3">
<h3 id="org55d4405"><span class="section-number-3">2.14.</span> Templated Functions and Templated Types</h3>
<div class="outline-text-3" id="text-2-14">
<p>
You do not ever need to implement a vector in Glint, as there is the dynamic array type built-in to the language. However, vectors are simple to understand, and widespread enough that I believe this to be the best (as in least-confusing) example to give.
</p>

<p>
A templated type is like a template expression that defines a type.
</p>

<div class="org-src-container">
<pre class="src src-glint">vector <span class="org-operator">::</span> <span class="org-type">struct</span> <span class="org-delimiter">(</span>T <span class="org-operator">:</span> <span class="org-type">type</span><span class="org-delimiter">)</span> <span class="org-delimiter">{</span>
  data <span class="org-operator">:</span> <span class="org-type">T.ptr</span>;
  size <span class="org-operator">:</span> <span class="org-type">uint</span>;
  capacity <span class="org-operator">:</span> <span class="org-type">uint</span>;
<span class="org-delimiter">}</span>;

my_vec_of_int <span class="org-operator">:</span> <span class="org-type">vector</span> <span class="org-type">int</span>;
</pre>
</div>

<p>
A templated function is like a template expression that defines a function.
The catch here is that the template arguments are all types (because, well, templating a function on a value seems an awful lot like you may just want to use a parameter instead <code>:^)</code>). Because of that, the syntax has removed the <code>(T1 : type, T2 : type)</code> boilerplate in favor of automagically generating them from the amount of unique <code>auto</code> types in the signature. Notice the <code>auto</code> type allows for partial definition of a type, just like C++20's concepts.
</p>

<div class="org-src-container">
<pre class="src src-glint">vector_push <span class="org-operator">:</span> <span class="org-type">void</span><span class="org-delimiter">(</span>vec <span class="org-operator">:</span> <span class="org-delimiter">(</span>vector auto.element<span class="org-delimiter">)</span>.ref, val <span class="org-operator">:</span> <span class="org-type">auto</span>.element<span class="org-delimiter">)</span> <span class="org-delimiter">{</span>
  <span class="org-keyword">if</span> vec.size <span class="org-operator">+</span> <span class="org-number">2</span> <span class="org-operator">&gt;</span> vec.capacity,
    vector_grow vec;

  <span class="org-operator">@</span>vec.data[vec.size] <span class="org-operator">:=</span> val;
  vec.size <span class="org-operator">+=</span> <span class="org-number">1</span>;
<span class="org-delimiter">}</span>;
</pre>
</div>

<p>
Now, upon invocation of <code>vector_push</code>, the compiler will first look for a defined function with the signature matching the given arguments (i.e. <code>auto.element</code> is <code>int</code>). If it exists, it will call it. If it doesn't, it will use the templated function's body as a template body and expand it with the given type(s). It will then call that defined function.
</p>

<div class="org-src-container">
<pre class="src src-glint">vector_push <span class="org-operator">::</span> template<span class="org-delimiter">(</span>element <span class="org-operator">:</span> type<span class="org-delimiter">)</span>
  <span class="org-function-name">vector_push_impl</span> <span class="org-operator">:</span> <span class="org-type">void</span><span class="org-delimiter">(</span>vec <span class="org-operator">:</span> vector element, val <span class="org-operator">:</span> element<span class="org-delimiter">)</span>
    ...;

<span class="org-comment">;; Invocations could be thought of like this</span>
<span class="org-delimiter">(</span>vector_push <span class="org-type">int</span><span class="org-delimiter">)</span> my_vec_of_int <span class="org-number">69</span>;
</pre>
</div>

<p>
Basically, a templated function is shorthand to define a template that defines a unique function for every unique set of types passed in place of <code>auto</code> in the parameters.
</p>
</div>
</div>
<div id="outline-container-orgb81cb90" class="outline-3">
<h3 id="orgb81cb90"><span class="section-number-3">2.15.</span> Modules</h3>
<div class="outline-text-3" id="text-2-15">
</div>
<div id="outline-container-org0f39d67" class="outline-4">
<h4 id="org0f39d67"><span class="section-number-4">2.15.1.</span> Writing A Module Vs A Program</h4>
<div class="outline-text-4" id="text-2-15-1">
<p>
A Glint program is a collection of Glint source code that may be compiled and linked to an executable. A Glint program may import Glint modules.
</p>

<p>
A Glint module is a collection of Glint source code that does not compile to executable, but rather a library. This library then may be used by a linker to include it's code in a separate executable. This library is also used by the Glint compiler to resolve the Glint module's metadata that produced it when compiling code that imports the module.
</p>

<p>
Programs and modules may import modules, but neither programs nor modules may import programs.
</p>
</div>
</div>
