docs/thebook.html
<div id="outline-container-orgc3f4204" class="outline-4">
<h4 id="orgc3f4204"><span class="section-number-4">2.15.2.</span> Exporting Variables</h4>
<div class="outline-text-4" id="text-2-15-2">
<p>
A Glint module may export any amount of variables, such that those variables are accessible by any Glint program or module that imports the module. This is done via the <code>export</code> keyword, a storage specifier. Storage specifiers come before the name, within a declaration expression.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-keyword">module</span> Foo;

<span class="org-keyword">export</span> foo <span class="org-operator">:</span> <span class="org-type">int</span> <span class="org-number">69</span>;
</pre>
</div>

<p>
Within Glint, you may now put <code>import Foo;</code> at the top of a file, and subsequent expressions will execute as if <code>foo : int 69;</code> was at the top of the file (but without having to execute any code for that to happen!).
</p>

<p>
In practice, this most often makes the symbol associated with the variable "visible" to the linker in the generated object file. This means that other object files may reference the symbol to access, operate on, and interact with the variable.
</p>
</div>
</div>
<div id="outline-container-orgd31f863" class="outline-4">
<h4 id="orgd31f863"><span class="section-number-4">2.15.3.</span> Importing Modules</h4>
<div class="outline-text-4" id="text-2-15-3">
<div class="org-src-container">
<pre class="src src-glint"><span class="org-keyword">import</span> Foo;

foo; <span class="org-comment">;; equals int 69</span>
</pre>
</div>

<p>
TODO: Mention Glint compiler not being able to find module metadata.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcc7a522" class="outline-2">
<h2 id="orgcc7a522"><span class="section-number-2">3.</span> Types</h2>
<div class="outline-text-2" id="text-3">
<p>
Just some extra information on the type sub-language. A lot of the first portion of the book goes into expressions, and types are used within them, but the types themselves are not fully expanded upon in one area. That's why this exists.
</p>
</div>
<div id="outline-container-org5de6620" class="outline-3">
<h3 id="org5de6620"><span class="section-number-3">3.1.</span> Built-in Types</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-glint"><span class="org-comment">;; architecture-sized integer. 64 bits on x86_64, for example.</span>
<span class="org-type">int</span>;
<span class="org-comment">;; architecture-sized unsigned integer. Same size as 'int'.</span>
<span class="org-type">uint</span>;
<span class="org-comment">;; Boolean: binary value 'true' or 'false'.</span>
<span class="org-type">bool</span>;
<span class="org-comment">;; The nothing type. Declares absence of something (i.e. a function that</span>
<span class="org-comment">;; doesn't return anything).</span>
<span class="org-type">void</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d95e87" class="outline-3">
<h3 id="org2d95e87"><span class="section-number-3">3.2.</span> FFI Types</h3>
<div class="outline-text-3" id="text-3-2">
<p>
FFI stands for Foreign Function Interface. These types allow you to define variables as if they had a type from another language. For now, C is the only supported "foreign" (read: non-Glint) language by the Lensor Compiler Collection Glint implementation.
</p>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-comment">;; The convention is to take the primitive integer type from C, and</span>
<span class="org-comment">;; prepend the 'c' character, codepoint U+0063. Where 'unsigned' would</span>
<span class="org-comment">;; appear, instead prepend 'cu'.</span>
<span class="org-type">cshort</span>;     <span class="org-comment">;; 'short'</span>
<span class="org-type">cint</span>;       <span class="org-comment">;; 'int'</span>
<span class="org-type">clong</span>;      <span class="org-comment">;; 'long'</span>
<span class="org-type">clonglong</span>;  <span class="org-comment">;; 'long long'</span>
<span class="org-comment">;; Unsigned</span>
<span class="org-type">cushort</span>;    <span class="org-comment">;; 'unsigned short'</span>
<span class="org-type">cuint</span>;      <span class="org-comment">;; 'unsigned int'</span>
<span class="org-type">culong</span>;     <span class="org-comment">;; 'unsigned long'</span>
<span class="org-type">culonglong</span>; <span class="org-comment">;; 'unsigned long long'</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd08cf5b" class="outline-3">
<h3 id="orgd08cf5b"><span class="section-number-3">3.3.</span> Arbitrary Integers</h3>
<div class="outline-text-3" id="text-3-3">
<p>
TODO
</p>
</div>
</div>
<div id="outline-container-orgb56876b" class="outline-3">
<h3 id="orgb56876b"><span class="section-number-3">3.4.</span> Types with One Element</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org5450bb4" class="outline-4">
<h4 id="org5450bb4"><span class="section-number-4">3.4.1.</span> Pointers</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
You can make a pointer to any type by appending <code>.ptr</code>.
</p>

<p>
This is a pointer to a signed integer type.
</p>
<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">int.ptr</span>;
</pre>
</div>

<p>
Pointers may be loaded from, which yields the underlying type.
</p>

<div class="org-src-container">
<pre class="src src-glint">value <span class="org-operator">:</span> <span class="org-type">int</span>
  <span class="org-number">69</span>;
pointer <span class="org-operator">:</span> <span class="org-type">int.ptr</span>
  <span class="org-operator">&amp;</span>value;
loaded_value <span class="org-operator">:</span> <span class="org-type">int</span>
  <span class="org-operator">@</span>pointer;
</pre>
</div>

<p>
Pointers may be stored into, which destrucively modifies the underlying value.
</p>

<div class="org-src-container">
<pre class="src src-glint">value <span class="org-operator">:</span> <span class="org-type">int</span>
  <span class="org-number">69</span>;
pointer <span class="org-operator">:</span> <span class="org-type">int.ptr</span>
  <span class="org-operator">&amp;</span>value;

<span class="org-operator">@</span>pointer <span class="org-operator">:=</span> <span class="org-number">420</span>;

value <span class="org-operator">=</span> <span class="org-number">69</span>; <span class="org-comment">;; false!!!</span>
</pre>
</div>

<p>
As you can see, a pointer doesn't store an <code>int</code> value, it stores somewhere an <code>int</code> may be found (upon loading from it). This also lets you change the value where that <code>int</code> may be found (upon storing into it).
</p>
</div>
</div>
