documentation/glint/thebook.txt


2.15.2 Exporting Variables
--------------------------

  A Glint module may export any amount of variables, such that those
  variables are accessible by any Glint program or module that imports
  the module. This is done via the `export' keyword, a storage
  specifier. Storage specifiers come before the name, within a
  declaration expression.

  ,----
  | module Foo;
  | 
  | export foo : int 69;
  `----

  Within Glint, you may now put `import Foo;' at the top of a file, and
  subsequent expressions will execute as if `foo : int 69;' was at the
  top of the file (but without having to execute any code for that to
  happen!).

  In practice, this most often makes the symbol associated with the
  variable "visible" to the linker in the generated object file. This
  means that other object files may reference the symbol to access,
  operate on, and interact with the variable.


2.15.3 Importing Modules
------------------------

  ,----
  | import Foo;
  | 
  | foo; ;; equals int 69
  `----

  TODO: Mention Glint compiler not being able to find module metadata.


3 Types
=======

  Just some extra information on the type sub-language. A lot of the
  first portion of the book goes into expressions, and types are used
  within them, but the types themselves are not fully expanded upon in
  one area. That's why this exists.


3.1 Built-in Types
~~~~~~~~~~~~~~~~~~

  ,----
  | ;; architecture-sized integer. 64 bits on x86_64, for example.
  | int;
  | ;; architecture-sized unsigned integer. Same size as 'int'.
  | uint;
  | ;; Boolean: binary value 'true' or 'false'.
  | bool;
  | ;; The nothing type. Declares absence of something (i.e. a function that
  | ;; doesn't return anything).
  | void;
  `----


3.2 FFI Types
~~~~~~~~~~~~~

  FFI stands for Foreign Function Interface. These types allow you to
  define variables as if they had a type from another language. For now,
  C is the only supported "foreign" (read: non-Glint) language by the
  Lensor Compiler Collection Glint implementation.

  ,----
  | ;; The convention is to take the primitive integer type from C, and
  | ;; prepend the 'c' character, codepoint U+0063. Where 'unsigned' would
  | ;; appear, instead prepend 'cu'.
  | cshort;     ;; 'short'
  | cint;       ;; 'int'
  | clong;      ;; 'long'
  | clonglong;  ;; 'long long'
  | ;; Unsigned
  | cushort;    ;; 'unsigned short'
  | cuint;      ;; 'unsigned int'
  | culong;     ;; 'unsigned long'
  | culonglong; ;; 'unsigned long long'
  `----


3.3 Arbitrary Integers
~~~~~~~~~~~~~~~~~~~~~~

  TODO


3.4 Types with One Element
~~~~~~~~~~~~~~~~~~~~~~~~~~

3.4.1 Pointers
--------------

  You can make a pointer to any type by appending `.ptr'.

  This is a pointer to a signed integer type.
  ,----
  | int.ptr;
  `----

  Pointers may be loaded from, which yields the underlying type.

  ,----
  | value : int
  |   69;
  | pointer : int.ptr
  |   &value;
  | loaded_value : int
  |   @pointer;
  `----

  Pointers may be stored into, which destrucively modifies the
  underlying value.

  ,----
  | value : int
  |   69;
  | pointer : int.ptr
  |   &value;
  | 
  | @pointer := 420;
  | 
  | value = 69; ;; false!!!
  `----

  As you can see, a pointer doesn't store an `int' value, it stores
  somewhere an `int' may be found (upon loading from it). This also lets
  you change the value where that `int' may be found (upon storing into
  it).


3.4.2 References
----------------
