documentation/glint/thebook.org
*** References

You can make a reference to /almost/ any type by appending =.ref=.

This is a reference to a signed integer type.
#+begin_src glint
  int.ref;
#+end_src

Like a pointer, a reference doesn't store the underlying value, but a location where that value may be found. The difference is that a reference does not require /explicit/ loading and storing via the =@= operator; you can just use it like it's the underlying type.

#+begin_src glint
  value : int
    69;

  reference : int.ref
    &value;

  reference -= 27;

  value = 42; ;; true!!!
#+end_src

# What types /can't/ you make references out of?

# Use case: function that modifies an index and reads from a [byte view]

#+begin_src glint
  reference_example : uint()
#+end_src

** Composite Types

A composite type is a type that is made up of other types; that is, these types allow you to group types together.

*** Struct Types

A struct type is a sequential set of typed values that may be accessed via a given name. These are called the struct's /members/.

For an instance of the following struct...
#+begin_src glint
  struct {
    x : int;
    y : uint;
  };
#+end_src

If =x= was modified, =y= would be unchanged, and vice versa. A struct may have as many members as you could feasibly want, and their types are not required to be unique. You may have two =int= typed values in one struct with different names.

*** Union Types

A union type is an non-type-safe way of converting between types. A union declaration looks a lot like a struct, but the underlying semantics are very different. For one, a union is only large enough to store it's largest member, and all the members share an address. This means that, if one member is changed, all the others are destructively modified! For most use cases, you should use a sum type instead. But, this is here if you know what you are doing and need to do it your way. You are the Glint programmer, after all, you are in total control.

For a real world use case: use unions to convert between a type and it's binary format easily.
#+begin_src glint
  union {
    value : int;
    bytes : [byte (sizeof int)];
  };
#+end_src

*** Sum Types

A sum type is a type-safe way of storing a group of types in one location. A sum type may only have one of it's members valid at a time, and, each time an access is performed, Glint will safely (and forcefully) exit the program before any memory errors may occur iff the access is not to the valid member.

A sum type's members are much like a union type's: only one member is valid at a given point in the program, and all the members share an address. However, the sum type has a hidden =tag= value that stores which member is currently valid (if any). Whenever an access occurs, this tag may be checked against, and an access to an invalid value will error. This means that sum types do not allow you to convert between types, like a union, but they do allow you to have one variable have "one of a group of" types.

** =sizeof= and =alignof=

=sizeof T= where =T= is any valid type will return the size *IN BITS* of the given type.

=alignof T= where =T= is any valid type will return the size *IN BYTES* of the given type.

*** On bits vs bytes

Bit alignment is not something that is supported by any real machine or language. By definition, a byte is the minimum addressable unit in any computer. So, when it comes to alignment of an address, bytes are relevant. However, when it comes to the size of a type in Glint, bits are definitely relevant, since you may have a =u27= or a =s42=.

* Postface

** Example Programs

*** Hello, World!

#+begin_src glint
  print "Hello, World!";
#+end_src

