docs/thebook.html
<div id="outline-container-orgc835363" class="outline-4">
<h4 id="orgc835363"><span class="section-number-4">3.4.2.</span> References</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
You can make a reference to <i>almost</i> any type by appending <code>.ref</code>.
</p>

<p>
This is a reference to a signed integer type.
</p>
<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">int.ref</span>;
</pre>
</div>

<p>
Like a pointer, a reference doesn't store the underlying value, but a location where that value may be found. The difference is that a reference does not require <i>explicit</i> loading and storing via the <code>@</code> operator; you can just use it like it's the underlying type.
</p>

<div class="org-src-container">
<pre class="src src-glint">value <span class="org-operator">:</span> <span class="org-type">int</span>
  <span class="org-number">69</span>;

reference <span class="org-operator">:</span> <span class="org-type">int.ref</span>
  <span class="org-operator">&amp;</span>value;

reference <span class="org-operator">-=</span> <span class="org-number">27</span>;

value <span class="org-operator">=</span> <span class="org-number">42</span>; <span class="org-comment">;; true!!!</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-function-name">reference_example</span> <span class="org-operator">:</span> <span class="org-type">uint</span><span class="org-delimiter">()</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgce3a3a1" class="outline-3">
<h3 id="orgce3a3a1"><span class="section-number-3">3.5.</span> Composite Types</h3>
<div class="outline-text-3" id="text-3-5">
<p>
A composite type is a type that is made up of other types; that is, these types allow you to group types together.
</p>
</div>
<div id="outline-container-orgc46548c" class="outline-4">
<h4 id="orgc46548c"><span class="section-number-4">3.5.1.</span> Struct Types</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
A struct type is a sequential set of typed values that may be accessed via a given name. These are called the struct's <i>members</i>.
</p>

<p>
For an instance of the following struct&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">struct</span> <span class="org-delimiter">{</span>
  x <span class="org-operator">:</span> <span class="org-type">int</span>;
  y <span class="org-operator">:</span> <span class="org-type">uint</span>;
<span class="org-delimiter">}</span>;
</pre>
</div>

<p>
If <code>x</code> was modified, <code>y</code> would be unchanged, and vice versa. A struct may have as many members as you could feasibly want, and their types are not required to be unique. You may have two <code>int</code> typed values in one struct with different names.
</p>
</div>
</div>
<div id="outline-container-org4f67000" class="outline-4">
<h4 id="org4f67000"><span class="section-number-4">3.5.2.</span> Union Types</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
A union type is an non-type-safe way of converting between types. A union declaration looks a lot like a struct, but the underlying semantics are very different. For one, a union is only large enough to store it's largest member, and all the members share an address. This means that, if one member is changed, all the others are destructively modified! For most use cases, you should use a sum type instead. But, this is here if you know what you are doing and need to do it your way. You are the Glint programmer, after all, you are in total control.
</p>

<p>
For a real world use case: use unions to convert between a type and it's binary format easily.
</p>
<div class="org-src-container">
<pre class="src src-glint"><span class="org-type">union</span> <span class="org-delimiter">{</span>
  value <span class="org-operator">:</span> <span class="org-type">int</span>;
  bytes <span class="org-operator">:</span> <span class="org-type">[byte (sizeof int)]</span>;
<span class="org-delimiter">}</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org2ed5bf7" class="outline-4">
<h4 id="org2ed5bf7"><span class="section-number-4">3.5.3.</span> Sum Types</h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
A sum type is a type-safe way of storing a group of types in one location. A sum type may only have one of it's members valid at a time, and, each time an access is performed, Glint will safely (and forcefully) exit the program before any memory errors may occur iff the access is not to the valid member.
</p>

<p>
A sum type's members are much like a union type's: only one member is valid at a given point in the program, and all the members share an address. However, the sum type has a hidden <code>tag</code> value that stores which member is currently valid (if any). Whenever an access occurs, this tag may be checked against, and an access to an invalid value will error. This means that sum types do not allow you to convert between types, like a union, but they do allow you to have one variable have "one of a group of" types.
</p>
</div>
</div>
</div>
<div id="outline-container-org6942970" class="outline-3">
<h3 id="org6942970"><span class="section-number-3">3.6.</span> <code>sizeof</code> and <code>alignof</code></h3>
<div class="outline-text-3" id="text-3-6">
<p>
<code>sizeof T</code> where <code>T</code> is any valid type will return the size <b>IN BITS</b> of the given type.
</p>

<p>
<code>alignof T</code> where <code>T</code> is any valid type will return the size <b>IN BYTES</b> of the given type.
</p>
</div>
<div id="outline-container-org5197776" class="outline-4">
<h4 id="org5197776"><span class="section-number-4">3.6.1.</span> On bits vs bytes</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
Bit alignment is not something that is supported by any real machine or language. By definition, a byte is the minimum addressable unit in any computer. So, when it comes to alignment of an address, bytes are relevant. However, when it comes to the size of a type in Glint, bits are definitely relevant, since you may have a <code>u27</code> or a <code>s42</code>.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org1516bcb" class="outline-2">
<h2 id="org1516bcb"><span class="section-number-2">4.</span> Postface</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga8a72b6" class="outline-3">
<h3 id="orga8a72b6"><span class="section-number-3">4.1.</span> Example Programs</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org5719436" class="outline-4">
<h4 id="org5719436"><span class="section-number-4">4.1.1.</span> Hello, World!</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-glint"><span class="org-keyword">print</span> <span class="org-string">"Hello, World!"</span>;
</pre>
</div>
</div>
</div>
