documentation/glint/thebook.txt

  You can make a reference to /almost/ any type by appending `.ref'.

  This is a reference to a signed integer type.
  ,----
  | int.ref;
  `----

  Like a pointer, a reference doesn't store the underlying value, but a
  location where that value may be found. The difference is that a
  reference does not require /explicit/ loading and storing via the `@'
  operator; you can just use it like it's the underlying type.

  ,----
  | value : int
  |   69;
  | 
  | reference : int.ref
  |   &value;
  | 
  | reference -= 27;
  | 
  | value = 42; ;; true!!!
  `----

  ,----
  | reference_example : uint()
  `----


3.5 Composite Types
~~~~~~~~~~~~~~~~~~~

  A composite type is a type that is made up of other types; that is,
  these types allow you to group types together.


3.5.1 Struct Types
------------------

  A struct type is a sequential set of typed values that may be accessed
  via a given name. These are called the struct's /members/.

  For an instance of the following struct...
  ,----
  | struct {
  |   x : int;
  |   y : uint;
  | };
  `----

  If `x' was modified, `y' would be unchanged, and vice versa. A struct
  may have as many members as you could feasibly want, and their types
  are not required to be unique. You may have two `int' typed values in
  one struct with different names.


3.5.2 Union Types
-----------------

  A union type is an non-type-safe way of converting between types. A
  union declaration looks a lot like a struct, but the underlying
  semantics are very different. For one, a union is only large enough to
  store it's largest member, and all the members share an address. This
  means that, if one member is changed, all the others are destructively
  modified! For most use cases, you should use a sum type instead. But,
  this is here if you know what you are doing and need to do it your
  way. You are the Glint programmer, after all, you are in total
  control.

  For a real world use case: use unions to convert between a type and
  it's binary format easily.
  ,----
  | union {
  |   value : int;
  |   bytes : [byte (sizeof int)];
  | };
  `----


3.5.3 Sum Types
---------------

  A sum type is a type-safe way of storing a group of types in one
  location. A sum type may only have one of it's members valid at a
  time, and, each time an access is performed, Glint will safely (and
  forcefully) exit the program before any memory errors may occur iff
  the access is not to the valid member.

  A sum type's members are much like a union type's: only one member is
  valid at a given point in the program, and all the members share an
  address. However, the sum type has a hidden `tag' value that stores
  which member is currently valid (if any). Whenever an access occurs,
  this tag may be checked against, and an access to an invalid value
  will error. This means that sum types do not allow you to convert
  between types, like a union, but they do allow you to have one
  variable have "one of a group of" types.


3.6 `sizeof' and `alignof'
~~~~~~~~~~~~~~~~~~~~~~~~~~

  `sizeof T' where `T' is any valid type will return the size *IN BITS*
  of the given type.

  `alignof T' where `T' is any valid type will return the size *IN
  BYTES* of the given type.


3.6.1 On bits vs bytes
----------------------

  Bit alignment is not something that is supported by any real machine
  or language. By definition, a byte is the minimum addressable unit in
  any computer. So, when it comes to alignment of an address, bytes are
  relevant. However, when it comes to the size of a type in Glint, bits
  are definitely relevant, since you may have a `u27' or a `s42'.


4 Postface
==========

4.1 Example Programs
~~~~~~~~~~~~~~~~~~~~

4.1.1 Hello, World!
-------------------

  ,----
  | print "Hello, World!";
  `----


4.1.2 Factorial
---------------

  ,----
