documentation/glint/thebook.org
*** Factorial

#+begin_src glint
  factorial : uint(n : uint) {
    result :: 1;

    cfor
        i : uint 1;
        i <= n;
        i += 1;
      result *= i;

    result;
  };

  ;; Calculate the factorial of 5, and return that.
  factorial 5;
#+end_src

*** Recursive Fibonacci

#+begin_src glint
  fib : uint(n : uint) {
    if n <= 1, return n;
    (fib n - 1) + (fib n - 2);
  };

  ;; Calculate 7th number in the Fibonacci sequence, and return that.
  fib 7;
#+end_src

Writing this example actually caught a bug in the compiler implementation regarding IR generation; see commit 9d152973, if interested.

*** Euclid GCD

#+begin_src glint
  gcd : uint(a : uint, b : uint) {
    if b = 0, return a;
    gcd b, a % b;
  };

  ;; Calculate the greatest common denominator of 32 and 80, and return
  ;; that.
  gcd 32, 80;
#+end_src
