docs/thebook.html
<div id="outline-container-orga632809" class="outline-4">
<h4 id="orga632809"><span class="section-number-4">4.1.2.</span> Factorial</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-glint"><span class="org-function-name">factorial</span> <span class="org-operator">:</span> <span class="org-type">uint</span><span class="org-delimiter">(</span>n <span class="org-operator">:</span> <span class="org-type">uint</span><span class="org-delimiter">)</span> <span class="org-delimiter">{</span>
  result <span class="org-operator">::</span> <span class="org-number">1</span>;

  <span class="org-keyword">cfor</span>
      i <span class="org-operator">:</span> <span class="org-type">uint</span> <span class="org-number">1</span>;
      i <span class="org-operator">&lt;=</span> n;
      i <span class="org-operator">+=</span> <span class="org-number">1</span>;
    result <span class="org-operator">*=</span> i;

  result;
<span class="org-delimiter">}</span>;

<span class="org-comment">;; Calculate the factorial of 5, and return that.</span>
factorial <span class="org-number">5</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org973c8f1" class="outline-4">
<h4 id="org973c8f1"><span class="section-number-4">4.1.3.</span> Recursive Fibonacci</h4>
<div class="outline-text-4" id="text-4-1-3">
<div class="org-src-container">
<pre class="src src-glint"><span class="org-function-name">fib</span> <span class="org-operator">:</span> <span class="org-type">uint</span><span class="org-delimiter">(</span>n <span class="org-operator">:</span> <span class="org-type">uint</span><span class="org-delimiter">)</span> <span class="org-delimiter">{</span>
  <span class="org-keyword">if</span> n <span class="org-operator">&lt;=</span> <span class="org-number">1</span>, <span class="org-keyword">return</span> n;
  <span class="org-delimiter">(</span>fib n <span class="org-operator">-</span> <span class="org-number">1</span><span class="org-delimiter">)</span> <span class="org-operator">+</span> <span class="org-delimiter">(</span>fib n <span class="org-operator">-</span> <span class="org-number">2</span><span class="org-delimiter">)</span>;
<span class="org-delimiter">}</span>;

<span class="org-comment">;; Calculate 7th number in the Fibonacci sequence, and return that.</span>
fib <span class="org-number">7</span>;
</pre>
</div>

<p>
Writing this example actually caught a bug in the compiler implementation regarding IR generation; see commit 9d152973, if interested.
</p>
</div>
</div>
<div id="outline-container-orgc96fd19" class="outline-4">
<h4 id="orgc96fd19"><span class="section-number-4">4.1.4.</span> Euclid GCD</h4>
<div class="outline-text-4" id="text-4-1-4">
<div class="org-src-container">
<pre class="src src-glint"><span class="org-function-name">gcd</span> <span class="org-operator">:</span> <span class="org-type">uint</span><span class="org-delimiter">(</span>a <span class="org-operator">:</span> <span class="org-type">uint</span>, b <span class="org-operator">:</span> <span class="org-type">uint</span><span class="org-delimiter">)</span> <span class="org-delimiter">{</span>
  <span class="org-keyword">if</span> b <span class="org-operator">=</span> <span class="org-number">0</span>, <span class="org-keyword">return</span> a;
  gcd b, a % b;
<span class="org-delimiter">}</span>;

<span class="org-comment">;; Calculate the greatest common denominator of 32 and 80, and return</span>
<span class="org-comment">;; that.</span>
gcd <span class="org-number">32</span>, <span class="org-number">80</span>;
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: lens_r</p>
<p class="date">Created: 2026-01-05 Mon 17:42</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
