documentation/glint/thebook.txt
  | factorial : uint(n : uint) {
  |   result :: 1;
  | 
  |   cfor
  |       i : uint 1;
  |       i <= n;
  |       i += 1;
  |     result *= i;
  | 
  |   result;
  | };
  | 
  | ;; Calculate the factorial of 5, and return that.
  | factorial 5;
  `----


4.1.3 Recursive Fibonacci
-------------------------

  ,----
  | fib : uint(n : uint) {
  |   if n <= 1, return n;
  |   (fib n - 1) + (fib n - 2);
  | };
  | 
  | ;; Calculate 7th number in the Fibonacci sequence, and return that.
  | fib 7;
  `----

  Writing this example actually caught a bug in the compiler
  implementation regarding IR generation; see commit 9d152973, if
  interested.


4.1.4 Euclid GCD
----------------

  ,----
  | gcd : uint(a : uint, b : uint) {
  |   if b = 0, return a;
  |   gcd b, a % b;
  | };
  | 
  | ;; Calculate the greatest common denominator of 32 and 80, and return
  | ;; that.
  | gcd 32, 80;
  `----
